[
  {
    "id": "8dd3a037-4f3c-4054-98db-22c634986b93",
    "name": "AI Features",
    "description": "Hiver AI brings intelligence to every part of your support workflow—helping agents respond faster, resolving routine queries automatically, and giving managers real visibility into quality. All powered by your team's knowledge.",
    "sort_order": 0,
    "sub_themes": [
      {
        "id": "e923f3e6-17e4-4b94-adc4-56faa64a8582",
        "name": "AI Copilot",
        "description": "AI Copilot helps support agents find answers instantly, generate drafts, and respond faster—without switching tabs or searching through docs. It brings your team's knowledge to where work happens.",
        "sort_order": 0
      },
      {
        "id": "5ac7b964-1f4c-4200-93f1-38d7ee06d3d8",
        "name": "AI Agent",
        "description": "AI Agent handles routine customer queries across chat and email automatically—resolving common questions instantly and escalating complex issues to your team with full context.",
        "sort_order": 1
      },
      {
        "id": "69f7b692-f355-4c3e-b044-9566a1777e4c",
        "name": "AI Knowledge",
        "description": "AI Knowledge connects your existing knowledge sources—Confluence, Google Drive, help docs—into a unified layer that powers both AI Copilot and AI Agent with accurate, up-to-date information.",
        "sort_order": 2
      },
      {
        "id": "16610f67-b4d3-4caf-86ac-e429575f8bff",
        "name": "AI Quality",
        "description": "AI Quality analyzes every conversation to score agent responses on completeness, tone, and resolution quality—giving managers visibility into performance and coaching opportunities without manual QA.",
        "sort_order": 3
      }
    ]
  },
  {
    "id": "82cb7a39-2da3-4b1e-a82f-37754704f497",
    "name": "Knowledge Base",
    "description": "Create and manage knowledge for both your customers and your team—from public help articles that reduce ticket volume to internal SOPs that help agents respond faster and more consistently.",
    "sort_order": 1,
    "sub_themes": [
      {
        "id": "2a8a9a66-0495-42ee-9772-1d07b7e42e6a",
        "name": "Help Center",
        "description": "Help Center lets you create and publish a branded knowledge base for your customers—so they can find answers on their own, reducing ticket volume and improving satisfaction.",
        "sort_order": 0
      },
      {
        "id": "a50b5bce-d5f4-4249-9597-205afff9008b",
        "name": "Internal Knowledge Base",
        "description": "Internal Knowledge Base gives your team a centralized place to document SOPs, processes, and institutional knowledge—so agents can find the right answers fast and respond consistently.",
        "sort_order": 1
      }
    ]
  }
]