{
  "transcript_id": "12_7691254619955540694",
  "call_id": "7691254619955540694",
  "title": "Hiver Demo | Carolina <> Rakesh",
  "started": "2026-01-30T19:30:00+05:30",
  "signals": [
    {
      "Theme": "Email Management",
      "Ask": "We need a solution primarily focused on email management for our reservations team.",
      "Priority": "High",
      "Evidence": "We want to find a better solution that is, you know, its main purpose is that like Hiver."
    },
    {
      "Theme": "Scalability",
      "Ask": "The chosen platform must be scalable to accommodate future growth from 15 to potentially 25 users.",
      "Priority": "High",
      "Evidence": "We also want to make sure that we can then, you know, move up or ensure that the plan that we pick makes sense for our future."
    },
    {
      "Theme": "Reporting and Visibility",
      "Ask": "We require improved reporting capabilities and visibility on team workload and email assignments.",
      "Priority": "High",
      "Evidence": "They also want to have a bit more visibility on who's working on what, and have a better auto assignment as well."
    },
    {
      "Theme": "Implementation Timeline",
      "Ask": "We aim to decommission Dynamics by the end of February and want to start onboarding the new tool as soon as possible.",
      "Priority": "High",
      "Evidence": "We want to move reasonably quickly to avoid that gap between decommissioning one platform and onboarding to the next."
    },
    {
      "Theme": "Support and Onboarding",
      "Ask": "We expect comprehensive onboarding and support included in the subscription without additional costs.",
      "Priority": "High",
      "Evidence": "I assume you don't have any sort of one-off implementation fees."
    },
    {
      "Theme": "Data Storage",
      "Ask": "There should be no limitations on data storage for email management.",
      "Priority": "Medium",
      "Evidence": "There is as such no limitation on data storage as long as your Outlook is processing those emails."
    },
    {
      "Theme": "Integration Flexibility",
      "Ask": "We want to ensure future integration capabilities with other platforms if needed.",
      "Priority": "Medium",
      "Evidence": "If we want to consider in future, is it just the ones you have that I can find on the website?"
    },
    {
      "Theme": "Customization of Reports",
      "Ask": "We need the ability to create custom reports based on our specific needs.",
      "Priority": "Medium",
      "Evidence": "Can we create our own version of reports or is that only a specific plan?"
    },
    {
      "Theme": "Customer Satisfaction Features",
      "Ask": "We would like to have customer satisfaction features included if possible.",
      "Priority": "Low",
      "Evidence": "If it's included in the plan we end up selecting, then it's always nice to have."
    }
  ]
}