{
  "transcript_id": "83_6891956699798489920",
  "call_id": "6891956699798489920",
  "title": "Hiver Demo | michael <> Rakesh",
  "started": "2025-11-10T13:29:24+05:30",
  "signals": [
    {
      "problem_statement": "The customer spends a lot of time sorting through emails, which is inefficient for their small team.",
      "customer_ask": "They want a solution that can help them be more efficient without being as complex as Salesforce.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer has issues with tracking missing stock and damaged goods using a Google spreadsheet, which is time-consuming.",
      "customer_ask": "They want a system that can assign ticket numbers and track these issues more effectively.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer experienced a significant email loss due to a staff member deleting emails instead of responding.",
      "customer_ask": "They need a solution that ensures no emails are missed, even when staff are away.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer does not have any reporting or analytics on their email management, leading to a lack of visibility on email status.",
      "customer_ask": "They want to track how many emails are open, pending, or closed.",
      "confidence": "medium"
    },
    {
      "problem_statement": "The customer needs a simple solution that non-technical staff can use without extensive training.",
      "customer_ask": "They require a user-friendly interface that their team can easily adopt.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer is concerned about managing personal emails of staff members while ensuring their own emails remain private.",
      "customer_ask": "They want to set up a hierarchy where they can manage staff members' personal inboxes without exposing their own.",
      "confidence": "medium"
    },
    {
      "problem_statement": "The customer currently lacks integration with social media platforms like Facebook and Instagram for managing messages.",
      "customer_ask": "They want to connect with Instagram messages, which is important for their business.",
      "confidence": "medium"
    }
  ]
}