{
  "transcript_id": "83_6891956699798489920",
  "call_id": "6891956699798489920",
  "title": "Hiver Demo | michael <> Rakesh",
  "started": "2025-11-10T13:29:24+05:30",
  "signals": [
    {
      "problem_statement": "The customer struggles with managing a high volume of emails and ensuring that no emails are missed, especially when team members are absent.",
      "customer_role": "Sales",
      "context": "Shared inbox for sales, 4 users, handling 40-50 emails daily.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer spends excessive time sorting through emails manually, which is inefficient for their small team.",
      "customer_role": "Sales",
      "context": "4 people using email daily, looking for a more efficient solution than Salesforce.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer has issues with team members deleting important emails instead of responding, leading to missed communications.",
      "customer_role": "Sales",
      "context": "Past experience of missing emails due to staff actions.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer relies heavily on Google Sheets for tracking stock and damaged goods, indicating a need for better integration and automation.",
      "customer_role": "Sales",
      "context": "Using a massive Google spreadsheet for tracking, looking for a more efficient system.",
      "confidence": "medium"
    },
    {
      "problem_statement": "The customer needs a simple-to-use solution that non-technical staff can operate without extensive training.",
      "customer_role": "Sales",
      "context": "Team members are technophobes and struggle with new software.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer requires a way to manage personal inboxes of team members while maintaining privacy for sensitive communications.",
      "customer_role": "Sales",
      "context": "Need to manage staff emails without exposing personal or sensitive information.",
      "confidence": "high"
    },
    {
      "problem_statement": "The customer lacks reporting and analytics on email management, which hinders their ability to track performance and efficiency.",
      "customer_role": "Sales",
      "context": "Currently using Gmail without any reporting tools.",
      "confidence": "medium"
    },
    {
      "problem_statement": "The customer is looking for a live chat solution that is not a chatbot, indicating a need for real-time human interaction.",
      "customer_role": "Sales",
      "context": "Currently using Zendesk live chat but seeking alternatives.",
      "confidence": "medium"
    },
    {
      "problem_statement": "The customer wants to integrate social media messaging (Instagram and Facebook) into their communication workflow, which is currently unsupported.",
      "customer_role": "Sales",
      "context": "Mainly receiving messages through Instagram.",
      "confidence": "medium"
    }
  ]
}