{
  "transcripts": [
    {
      "transcript_id": "01_4026544292394061551",
      "call_id": "4026544292394061551",
      "title": "Hiver Demo | Richard <> Rakesh",
      "started": "2025-11-17T17:30:13+05:30",
      "signals": [
        {
          "Theme": "Usage Requirements",
          "Ask": "We need to understand the specific use cases for Hiver from our marketing team.",
          "Priority": "High",
          "Evidence": "I'm a little bit in the dark as to what the usage requirement would be."
        },
        {
          "Theme": "Compliance and Policies",
          "Ask": "We need to ensure that Hiver complies with our IT policies before adoption.",
          "Priority": "High",
          "Evidence": "We have to facilitate as it and make sure that it's compliant with all our policies."
        },
        {
          "Theme": "Reporting and Analytics",
          "Ask": "We require reporting capabilities to track response times and query management.",
          "Priority": "High",
          "Evidence": "I think there are a few emails that go astray that just don't get covered."
        },
        {
          "Theme": "Implementation Timeline",
          "Ask": "We need a clear timeline for implementing Hiver once a decision is made.",
          "Priority": "Medium",
          "Evidence": "I haven't been given a strict deadline but... it's become sensitive that we've been getting queries about courses."
        },
        {
          "Theme": "User Management",
          "Ask": "We need to assess how many users will access shared inboxes across the organization.",
          "Priority": "Medium",
          "Evidence": "I don't have any sense as to how many people and how many shared inboxes across the business in detail."
        }
      ]
    },
    {
      "transcript_id": "02_8772136893263613489",
      "call_id": "8772136893263613489",
      "title": "Hiver Demonstration",
      "started": "2025-11-17T13:30:26.166+05:30",
      "signals": [
        {
          "Theme": "Shared Inbox Functionality",
          "Ask": "We need the ability to create multiple shared inboxes under one Google account.",
          "Priority": "High",
          "Evidence": "The only main thing that I could see is as a breaker there... you could only set up one shared inbox for each Google account."
        },
        {
          "Theme": "Access Control",
          "Ask": "We require the ability to restrict access to certain inboxes for specific team members.",
          "Priority": "High",
          "Evidence": "We have people that we don't need to have access to certain accounting emails."
        },
        {
          "Theme": "Mobile Experience",
          "Ask": "We need a mobile app experience that mirrors the desktop functionality, including shared labels.",
          "Priority": "Medium",
          "Evidence": "The ideal scenario would be for us to have a mobile version of exactly what you're seeing right here."
        },
        {
          "Theme": "AI Functionality",
          "Ask": "We want robust AI capabilities to automate our email workflows and improve efficiency.",
          "Priority": "Medium",
          "Evidence": "We basically just want the ability to collaborate on emails is, I guess, is the... yeah."
        },
        {
          "Theme": "Integration with Google Groups",
          "Ask": "We need confirmation on whether Hiver can integrate with Google Groups for managing shared inboxes.",
          "Priority": "High",
          "Evidence": "I guess what I'm getting at is does Google groups provide us with the ability to restrict access to certain inboxes."
        }
      ]
    },
    {
      "transcript_id": "03_7254737904932133804",
      "call_id": "7254737904932133804",
      "title": "Hiver Demo | Aidan <> Matthew",
      "started": "2025-11-15T03:30:55+05:30",
      "signals": [
        {
          "Theme": "Integration Requirements",
          "Ask": "Hiver must integrate seamlessly with Hubspot, Slack, and Jira.",
          "Priority": "High",
          "Evidence": "Hubspot is the most important; that will get us there."
        },
        {
          "Theme": "Internal Ticketing",
          "Ask": "The solution should allow for internal tickets to be flagged and routed to the appropriate team members.",
          "Priority": "High",
          "Evidence": "Is there a way for internal tickets to be flagged?"
        },
        {
          "Theme": "Onboarding Flexibility",
          "Ask": "Onboarding should be flexible, allowing for asynchronous training and not requiring all team members to be present.",
          "Priority": "Medium",
          "Evidence": "Do you need everybody on a call for onboarding? Can it be asynchronous?"
        },
        {
          "Theme": "Cost Efficiency",
          "Ask": "The solution must provide cost savings compared to the current use of Front.",
          "Priority": "High",
          "Evidence": "If we can save money and there's features that we're not using... it would make sense."
        },
        {
          "Theme": "Data Migration",
          "Ask": "There should be a straightforward process for migrating data from Front to Hiver.",
          "Priority": "Medium",
          "Evidence": "What is the typical kind of pushback... on migrating that over?"
        }
      ]
    },
    {
      "transcript_id": "04_105032147065518287",
      "call_id": "105032147065518287",
      "title": "Hiver Demo | Jordan <> Cole",
      "started": "2025-11-15T02:03:53+05:30",
      "signals": [
        {
          "Theme": "Email Management",
          "Ask": "We need a system to manage personal and shared emails effectively.",
          "Priority": "High",
          "Evidence": "I think we can... it could be a shared account."
        },
        {
          "Theme": "Automation Features",
          "Ask": "We require automation to categorize emails based on specific language.",
          "Priority": "Medium",
          "Evidence": "Are there rules that we could set, that if there's certain language, it goes to a certain mailbox?"
        },
        {
          "Theme": "Analytics and Reporting",
          "Ask": "We need to track response times and resolution times for compliance purposes.",
          "Priority": "High",
          "Evidence": "If I wanted to see all the communications within one shot that I can navigate between all of them?"
        },
        {
          "Theme": "Trial Environment",
          "Ask": "We prefer a sandbox environment to test the system before full implementation.",
          "Priority": "Medium",
          "Evidence": "Is there a test environment where we can try this instead of going live?"
        },
        {
          "Theme": "Internal Collaboration",
          "Ask": "We want to communicate internally about specific emails without confusion.",
          "Priority": "High",
          "Evidence": "I want to be able to communicate internally with the teams to talk about certain emails."
        }
      ]
    },
    {
      "transcript_id": "05_235740318400020807",
      "call_id": "235740318400020807",
      "title": "Hiver Meeting with Mighty Nonprofits",
      "started": "2025-11-15T01:29:49+05:30",
      "signals": [
        {
          "Theme": "Client Communication Structure",
          "Ask": "We need clarity on how to structure our client communications within Hiver.",
          "Priority": "High",
          "Evidence": "We're trying to figure out what that structure might look like."
        },
        {
          "Theme": "Cost Management",
          "Ask": "Cost is a significant concern, and we want to avoid expensive plans.",
          "Priority": "High",
          "Evidence": "We're also trying to see what can we do without like having to upgrade to the super expensive plans."
        },
        {
          "Theme": "Email Assignment Automation",
          "Ask": "We require automation to ensure emails are assigned correctly based on client associations.",
          "Priority": "High",
          "Evidence": "What we don't want is like 100 unassigned emails every day."
        },
        {
          "Theme": "AI Integration",
          "Ask": "We want AI capabilities integrated into the system without additional costs.",
          "Priority": "Medium",
          "Evidence": "It's included in most of the other software that we're looking at."
        },
        {
          "Theme": "Onboarding Support",
          "Ask": "We need flexible onboarding support without a set limit on meetings.",
          "Priority": "Medium",
          "Evidence": "You tell us, we don't there's no like, oh, you get five meetings and nothing like that."
        },
        {
          "Theme": "Trial Period",
          "Ask": "We want a trial period to test the software before committing.",
          "Priority": "Medium",
          "Evidence": "I can demo it and plug it in and start playing with it."
        },
        {
          "Theme": "Contract Flexibility",
          "Ask": "We need options for a flexible contract or a trial period to avoid long-term commitments.",
          "Priority": "High",
          "Evidence": "Are we set on a contract? Are we tied into it?"
        }
      ]
    },
    {
      "transcript_id": "06_1088511405148301239",
      "call_id": "1088511405148301239",
      "title": "Hiver & Sasha Hathaway with Winning by Design",
      "started": "2025-11-15T01:29:12+05:30",
      "signals": [
        {
          "Theme": "AI Feature Setup",
          "Ask": "We need assistance in setting up AI tagging and automations for our support requests.",
          "Priority": "High",
          "Evidence": "I would love to explore that and maybe have you walk me through how that works right now."
        },
        {
          "Theme": "Trial Extension",
          "Ask": "Please extend our trial period by at least two weeks to finalize budget approval.",
          "Priority": "High",
          "Evidence": "Is there a way to potentially add like two more weeks to that just so I can run this up the chain?"
        },
        {
          "Theme": "Cost Clarity",
          "Ask": "Provide a clear breakdown of the total cost for the AI features for our team.",
          "Priority": "Medium",
          "Evidence": "Can you just include the total price?"
        },
        {
          "Theme": "User Access",
          "Ask": "We only need the AI features enabled for one email address, not all users.",
          "Priority": "Medium",
          "Evidence": "I just need it set up so that it automates these responses."
        },
        {
          "Theme": "Training Process",
          "Ask": "Clarify the process for training the AI with existing emails for tagging.",
          "Priority": "Medium",
          "Evidence": "Can you go a little bit more into the training aspect and adding those emails to train it on that tag?"
        }
      ]
    },
    {
      "transcript_id": "07_1889972360811057762",
      "call_id": "1889972360811057762",
      "title": "Hiver Demo | Asaf <> Cole",
      "started": "2025-11-15T01:17:15+05:30",
      "signals": [
        {
          "Theme": "Support Channels",
          "Ask": "We need support that includes ticketing, chat, and email management.",
          "Priority": "High",
          "Evidence": "We are looking for a support that includes like ticketing and chat and really covering all emails from our customers."
        },
        {
          "Theme": "Integration Requirements",
          "Ask": "We require integration with Slack for ticket notifications.",
          "Priority": "High",
          "Evidence": "Is there a way to integrate you guys to slack? Let's say that if there's a new ticket or a new request that is opening, it could also notify the team over slack."
        },
        {
          "Theme": "Performance Metrics",
          "Ask": "We need the ability to define maximum response times and SLAs for support tickets.",
          "Priority": "Medium",
          "Evidence": "Is there a way to define like maximum time to response and stuff like that?"
        },
        {
          "Theme": "Onboarding Support",
          "Ask": "We expect a dedicated customer success manager for onboarding and implementation.",
          "Priority": "Medium",
          "Evidence": "We will provide you a dedicated customer success manager."
        },
        {
          "Theme": "Pricing Flexibility",
          "Ask": "We need clarity on pricing adjustments as our user base grows.",
          "Priority": "Medium",
          "Evidence": "Is the price changes when the volume is higher or it still remains the same?"
        }
      ]
    },
    {
      "transcript_id": "08_7733639255746550362",
      "call_id": "7733639255746550362",
      "title": "Hiver Demo | Sara <> Matt",
      "started": "2025-11-15T00:30:47+05:30",
      "signals": [
        {
          "Theme": "Shared Inbox Functionality",
          "Ask": "We need a shared inbox solution that is easier to use than Hubspot.",
          "Priority": "High",
          "Evidence": "Hubspot doesn't give us quite the ease of use that we need for handling shared inboxes."
        },
        {
          "Theme": "Analytics and Reporting",
          "Ask": "We require robust analytics and reporting capabilities to track email performance and customer interactions.",
          "Priority": "High",
          "Evidence": "The analytics aren't quite there with our current setup."
        },
        {
          "Theme": "Integration with Tools",
          "Ask": "We need integration with Aircall and Slack for notifications and call management.",
          "Priority": "Medium",
          "Evidence": "We have teams who don't necessarily live in their inbox, who are more on Slack."
        },
        {
          "Theme": "User Adoption Conditions",
          "Ask": "All team members must be on the same platform for effective use of the shared inbox.",
          "Priority": "High",
          "Evidence": "It's an all or nothing thing; everyone would have to use work out of here."
        },
        {
          "Theme": "Custom Reporting Needs",
          "Ask": "We need the ability to create custom reports based on specific tags and user interactions.",
          "Priority": "Medium",
          "Evidence": "We want to understand when those people are emailing in, who they're talking to, and how many different people they are having touch points with."
        }
      ]
    },
    {
      "transcript_id": "09_6599261313015813853",
      "call_id": "6599261313015813853",
      "title": "Hiver Partnership Kick Off",
      "started": "2025-11-15T00:01:07+05:30",
      "signals": [
        {
          "Theme": "Visibility in Sales Inbox",
          "Ask": "I need to be able to see what's happening in the sales inbox.",
          "Priority": "High",
          "Evidence": "I need oversight and, but I don't need to be part of the round Robin."
        },
        {
          "Theme": "Exclusion from Round Robin",
          "Ask": "I need the ability to exclude certain users from the round robin.",
          "Priority": "High",
          "Evidence": "Sometimes I have to assist or give information, right?"
        },
        {
          "Theme": "Timely Feature Release",
          "Ask": "I need confirmation that the exclusion feature will be released on time.",
          "Priority": "High",
          "Evidence": "I want to be absolutely upfront with you and make sure that we're not just saying this."
        },
        {
          "Theme": "Product Demonstration",
          "Ask": "I would like to see a demonstration of the product's features.",
          "Priority": "Medium",
          "Evidence": "I'd love to see it."
        },
        {
          "Theme": "Implementation Support",
          "Ask": "I need assurance that my team will be fully set up and supported during implementation.",
          "Priority": "Medium",
          "Evidence": "Make sure all of these workflows just making sure that your team is fully set up and implemented."
        }
      ]
    },
    {
      "transcript_id": "100_4133813100881805931",
      "call_id": "4133813100881805931",
      "title": "Hiver Demo | James <> Cole",
      "started": "2025-11-10T21:30:40+05:30",
      "signals": [
        {
          "Theme": "Email Management",
          "Ask": "We need a solution that simplifies managing high volumes of emails across multiple shared mailboxes.",
          "Priority": "High",
          "Evidence": "It's a high volume and we find it quite difficult to kind of manage the inbox at the moment."
        },
        {
          "Theme": "Integration with Google Workspace",
          "Ask": "The solution must integrate seamlessly with our Google Workspace environment.",
          "Priority": "High",
          "Evidence": "We recently transitioned from O365 to Google about a month ago."
        },
        {
          "Theme": "Custom Status Tracking",
          "Ask": "We require the ability to create custom statuses for email tracking beyond just open, pending, and closed.",
          "Priority": "Medium",
          "Evidence": "Can you create different statuses other than open pending and closed, for example, sent to it for review or sent for DocuSign?"
        },
        {
          "Theme": "Analytics and Reporting",
          "Ask": "We need standard metrics like time to respond, time to resolution, and ticket volume by individual for performance tracking.",
          "Priority": "Medium",
          "Evidence": "Just like I guess as a team like the kind of standard metrics like time to respond, time to resolution, like number of tickets by individuals?"
        },
        {
          "Theme": "Security Compliance",
          "Ask": "The solution must meet our security requirements and certifications, including ISO and HIPAA compliance.",
          "Priority": "High",
          "Evidence": "Can you talk us through your kind of security posture and certifications?"
        }
      ]
    }
  ]
}