{
  "transcripts": [
    {
      "transcript_id": "01_2363083900669717369",
      "call_id": "2363083900669717369",
      "title": "Gasera <> Hiver : Demo",
      "started": "2025-11-03T17:30:21+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks automation tools to manage support emails effectively, leading to manual forwarding and tracking issues.",
          "customer_ask": "I would need to automate that because now I'm responsible for the support in terms that I'll forward the message to someone in our team.",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "14 team members managing support emails through a shared Google group.",
          "suggested_solution": "It would be good if I could create templates and just send them."
        },
        {
          "problem_statement": "The customer finds it challenging to track the status of support cases due to the lack of visibility in email assignments.",
          "customer_ask": "I need some kind of automation to help with the workflow, and to help like see where the case is going.",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "14 team members managing support emails through a shared Google group.",
          "suggested_solution": "We want the messages to come into the support file so that everyone sees them and stays visible."
        },
        {
          "problem_statement": "The customer is overwhelmed by the volume of repetitive responses required for support inquiries.",
          "customer_ask": "It would be good if I could create templates and just send them.",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "14 team members managing support emails through a shared Google group.",
          "suggested_solution": "I can always search and I can start the emails and I can tag them as to do list but... it's starting to I'm at a point that there's so many cases."
        }
      ]
    },
    {
      "transcript_id": "01_5759700453900699854",
      "call_id": "5759700453900699854",
      "title": "Health Note<>Hiver: Intro Call",
      "started": "2025-12-30T00:07:44+05:30",
      "signals": [
        {
          "problem_statement": "The customer finds Zendesk clunky and hard to set up desired workflows.",
          "customer_ask": "Looking for a platform that is easy to use and set up workflows.",
          "customer_role": "Admin",
          "context": "Customer support team of five people, evaluating alternatives to Zendesk.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a platform that integrates support emails without using a shared inbox.",
          "customer_ask": "Wants everything to be on one platform instead of using Gmail with a shared inbox.",
          "customer_role": "Admin",
          "context": "Customer support team of five people, evaluating alternatives to Zendesk.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer requires HIPAA compliance and SOC 2 Type 2 certification for handling sensitive data.",
          "customer_ask": "Confirms the need for HIPAA compliance and SOC 2 Type 2 certification.",
          "customer_role": "Admin",
          "context": "Customer support team of five people, working with hospitals and clinics.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for a chat feature as they currently do not have one.",
          "customer_ask": "Wants a platform that includes chat functionality.",
          "customer_role": "Admin",
          "context": "Customer support team of five people, currently using Zendesk without chat.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the cost of the proposed solution compared to their current tools.",
          "customer_ask": "Wants to understand pricing and what is included in the package.",
          "customer_role": "Admin",
          "context": "Customer support team of five people, evaluating alternatives to Zendesk.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "02_1779613692961633968",
      "call_id": "1779613692961633968",
      "title": "Hiver Product Demo : Chris<> Yukta",
      "started": "2025-11-03T18:09:44+05:30",
      "signals": [
        {
          "problem_statement": "The customer is struggling to manage and organize communications from multiple channels effectively.",
          "customer_ask": "Looking to collate all different channels into one place.",
          "suggested_solution": "Revert back to using Hiver for better workflow.",
          "customer_role": "Admin",
          "context": "Small business with a small team managing a marketplace.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is facing limitations with the current WhatsApp integration in Hiver.",
          "customer_ask": "Wants to explore integrating WhatsApp into Hiver.",
          "suggested_solution": "Find a way to manage WhatsApp communications more effectively.",
          "customer_role": "Admin",
          "context": "Small business with a small team managing a marketplace.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the cost of multiple subscriptions and is looking for a more budget-friendly solution.",
          "customer_ask": "Wants to discuss the best case scenario on pricing.",
          "suggested_solution": "Reinstate the previous plan or find a suitable pricing option.",
          "customer_role": "Admin",
          "context": "Small business with a small team managing a marketplace.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about the capabilities of the AI features in Hiver and their associated costs.",
          "customer_ask": "Wants to know if AI features are included in the plan.",
          "suggested_solution": "Clarify the pricing and functionality of AI features.",
          "customer_role": "Admin",
          "context": "Small business with a small team managing a marketplace.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "02_4097682197132396245",
      "call_id": "4097682197132396245",
      "title": "Hiver Demo: Dez <> Matt",
      "started": "2025-12-30T00:35:49+05:30",
      "signals": [
        {
          "problem_statement": "The customer is looking for a cost-saving alternative to their current solution, Help Scout.",
          "customer_ask": "I want to make sure that I'm making the right decision.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of three using shared emails in Google Workspace"
        },
        {
          "problem_statement": "The customer is concerned about losing functionality when switching from Help Scout to Hiver.",
          "customer_ask": "I want to make sure I'm not going to lose any functions.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of three using shared emails in Google Workspace"
        },
        {
          "problem_statement": "The customer is unsure about the limitations of the free account and its suitability for setting up their needs.",
          "customer_ask": "Is that enough for me to like work in there and set it up?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team of three using shared emails in Google Workspace"
        },
        {
          "problem_statement": "The customer is frustrated with the product's user licensing model, which requires purchasing in buckets.",
          "customer_ask": "Why can't I just buy three?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of three using shared emails in Google Workspace"
        },
        {
          "problem_statement": "The customer is confused about the billing information provided on the website regarding user limits.",
          "customer_ask": "Where do you see that it's sold in buckets?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team of three using shared emails in Google Workspace"
        }
      ]
    },
    {
      "transcript_id": "03_4349435023058882263",
      "call_id": "4349435023058882263",
      "title": "Hiver Demo | Ollie <> Yukta",
      "started": "2025-11-03T19:30:22+05:30",
      "signals": [
        {
          "problem_statement": "Managing incoming emails through multiple group and individual email addresses is becoming increasingly difficult as the volume of leads grows.",
          "customer_ask": "We want to better manage the emails that come in on the sales side.",
          "suggested_solution": "A unified inbox type solution where replies can be sent from individual email addresses while managing group emails.",
          "customer_role": "Sales",
          "context": "Team of 10 managing multiple email addresses for sales and customer service.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of automation in assigning emails to team members based on specific criteria, leading to inefficiencies.",
          "customer_ask": "We want emails addressed to specific individuals to be automatically assigned to them.",
          "suggested_solution": "Set up conditions for automatic assignment based on the content of incoming emails.",
          "customer_role": "Sales",
          "context": "Team of 10 managing multiple email addresses for sales and customer service.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The current email management process lacks visibility and tracking, making it hard to ensure all emails are addressed.",
          "customer_ask": "We need a way to track how we are responding to emails and ensure nothing slips through the cracks.",
          "suggested_solution": "Implement a system that provides visibility into email handling and response tracking.",
          "customer_role": "Sales",
          "context": "Team of 10 managing multiple email addresses for sales and customer service.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no existing feature for AI to act as a support agent, which limits efficiency in handling initial customer inquiries.",
          "customer_ask": "We are looking for a chatbot functionality that can handle initial responses before escalating to a human.",
          "suggested_solution": "Develop a feature where AI can draft responses and only escalate to a human if necessary.",
          "customer_role": "Sales",
          "context": "Team of 10 managing multiple email addresses for sales and customer service.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "03_5719076601574032786",
      "call_id": "5719076601574032786",
      "title": "Hiver Demo | Justin <> Cole",
      "started": "2025-12-30T01:29:12+05:30",
      "signals": [
        {
          "problem_statement": "The customer struggles to manage a high volume of emails from multiple businesses in a single mailbox, leading to confusion and delays in response times.",
          "customer_ask": "They need a platform that can categorize emails based on urgency and type.",
          "suggested_solution": "A system that can automatically categorize emails into separate folders for urgent payment queries, advertisements, and other categories.",
          "customer_role": "Admin",
          "context": "The customer manages emails for 13 different businesses across various locations.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks a way to assign specific emails to team members effectively, which hampers workflow.",
          "customer_ask": "They need a feature that allows for assigning emails to specific team members.",
          "suggested_solution": "Utilization of AI functionality to assign emails based on content.",
          "customer_role": "Admin",
          "context": "The customer has a team of three managing multiple inboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unable to visualize and track the status of incoming emails effectively, which affects their ability to respond in a timely manner.",
          "customer_ask": "They want a dashboard that shows the count of different types of emails received.",
          "suggested_solution": "A dashboard that categorizes emails and shows counts for different types like invoices and marketing emails.",
          "customer_role": "Admin",
          "context": "The customer is managing multiple inboxes and needs better oversight.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "04_3913880393159874408",
      "call_id": "3913880393159874408",
      "title": "Hiver Demo | Jordan <> Cole",
      "started": "2025-12-30T02:02:36+05:30",
      "signals": [
        {
          "problem_statement": "The customer is looking for better control and visibility over emails sent and received by instructors using shared inboxes.",
          "customer_ask": "Will we be able to have more control over those, see what emails are being sent and received?",
          "customer_role": "Admin",
          "context": "Team of instructors managing class-related inquiries through shared inboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer wants to create email aliases for instructors instead of using individual emails.",
          "customer_ask": "Would our instructors then sign in to Gmail with the training email rather than their individual emails?",
          "customer_role": "Admin",
          "context": "Team of instructors managing class-related inquiries.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is unsure about the internal communication capabilities within the product.",
          "customer_ask": "Can you create a chat between us and another employee?",
          "customer_role": "Admin",
          "context": "Team of instructors managing class-related inquiries.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "04_7140568802910404179",
      "call_id": "7140568802910404179",
      "title": "Puntetese Commercials <> Hiver",
      "started": "2025-11-03T20:43:42.184+05:30",
      "signals": [
        {
          "problem_statement": "The customer experienced delays in email automation triggering.",
          "customer_ask": "The customer implied a need for faster automation processing.",
          "suggested_solution": "The customer suggested that the system should not take long to trigger automations.",
          "customer_role": "Admin",
          "context": "Team size not specified, discussing email automation.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer faced confusion regarding the setup and verification process for email sending.",
          "customer_ask": "The customer asked for clarification on the verification steps.",
          "suggested_solution": "The customer implied a need for clearer instructions on the verification process.",
          "customer_role": "Admin",
          "context": "Team size not specified, discussing email setup.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "05_4946129105178624542",
      "call_id": "4946129105178624542",
      "title": "Hiver Account & Mailbox Setup || Shop Harbour",
      "started": "2025-11-03T21:30:27+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks visibility into individual inboxes, which can lead to communication breakdowns when team members are unavailable.",
          "customer_ask": "More information on how the email flow works.",
          "suggested_solution": "A tech demo on the difference between the growth and elite plans.",
          "customer_role": "Admin",
          "context": "Small team of 2 to 200, handling a high volume of customer relationships.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the manual approach to managing emails in shared mailboxes, which may lead to inefficiencies.",
          "customer_ask": "Clarification on the automation capabilities.",
          "suggested_solution": "Automation to push emails from individual inboxes to shared mailboxes.",
          "customer_role": "Admin",
          "context": "Small team of 2 to 200, handling a high volume of customer relationships.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "05_5055467912976122580",
      "call_id": "5055467912976122580",
      "title": "Hiver Demo | Arlene <> Matthew",
      "started": "2025-12-30T03:00:26+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs a way to support their customer service agents without replacing them, but is unsure if the product can facilitate this.",
          "customer_ask": "They want to make it easy for their customer service agents to provide support.",
          "customer_role": "CSM",
          "context": "Small team in beta testing phase, focusing on content creators.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the lack of support for voice notes, which are becoming a common communication method.",
          "customer_ask": "They want to know if voice notes can be supported.",
          "suggested_solution": "They implied a need for a system that can convert voice notes to emails.",
          "customer_role": "CSM",
          "context": "Small team in beta testing phase, focusing on content creators.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer cannot access performance analytics without upgrading from the free tier.",
          "customer_ask": "They want to know how to monitor performance without upgrading.",
          "customer_role": "CSM",
          "context": "Small team in beta testing phase, focusing on content creators.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about the limitations of the free tier, particularly regarding the knowledge base functionality.",
          "customer_ask": "They want to know if they can use an AI-enabled knowledge base.",
          "customer_role": "CSM",
          "context": "Small team in beta testing phase, focusing on content creators.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "06_5385865537813788084",
      "call_id": "5385865537813788084",
      "title": "Hiver Demo | Young <> Yukta",
      "started": "2025-12-30T12:30:17+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unable to make shared emails private after drafting them for their boss.",
          "customer_ask": "How can we make the thread private again?",
          "suggested_solution": "A feature to easily toggle the privacy of email threads after drafting.",
          "customer_role": "End User",
          "context": "Small team, managing shared inbox for email drafting.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer finds the process of splitting conversations to make them private not scalable.",
          "customer_ask": "Could you walk me through how to use the shared inbox with the unassigned?",
          "suggested_solution": "A more efficient way to manage private conversations without splitting.",
          "customer_role": "End User",
          "context": "Small team, managing shared inbox for email drafting.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is experiencing issues locating shared drafts in the system.",
          "customer_ask": "Is there like a separate folder that I can just, he can just check all my drafts?",
          "suggested_solution": "Improved visibility or organization for shared drafts.",
          "customer_role": "End User",
          "context": "Small team, managing shared inbox for email drafting.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "06_8094309312712548763",
      "call_id": "8094309312712548763",
      "title": "Hiver Demo | Ellen <> Jeevan",
      "started": "2025-11-03T22:01:44+05:30",
      "signals": [
        {
          "problem_statement": "The customer is experiencing issues with managing communication effectively due to the increasing number of team members involved.",
          "customer_ask": "Understanding what avenues we can go in from.",
          "suggested_solution": "Integration with text platforms like Apple.",
          "customer_role": "Admin",
          "context": "Team of 10 managing shared communication.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about missed communications and dropped tasks as their team grows.",
          "customer_ask": "Looking for solutions to prevent things from getting dropped and missed.",
          "suggested_solution": "Automation features to streamline communication management.",
          "customer_role": "Admin",
          "context": "Team of 10 managing shared communication.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for better integration options with their existing tools, specifically Microsoft and Apple.",
          "customer_ask": "Inquiring about integration with Apple accounts.",
          "suggested_solution": "Expand integration capabilities to include more platforms.",
          "customer_role": "Admin",
          "context": "Team of 10 managing shared communication.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "07_4927753820128544559",
      "call_id": "4927753820128544559",
      "title": "Hiver Demo | Sulayman <> Matt",
      "started": "2025-11-03T22:01:17+05:30",
      "signals": [
        {
          "problem_statement": "The current email system leads to delays in response times, risking the loss of projects due to unassigned emails.",
          "customer_ask": "Want to ensure there's an SLA on responses and proper workflows for email assignments.",
          "customer_role": "Admin",
          "context": "Agency service business with a small team handling multiple types of inquiries through a single email.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no integration with the project management tool 'Bonsai', which complicates workflow.",
          "customer_ask": "Looking for a way to integrate with their project management tool.",
          "customer_role": "Admin",
          "context": "Agency service business managing project inquiries and needing to track them in a project management system.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a way to track who has read notifications within the team.",
          "customer_ask": "Inquiring about tracking read receipts for notifications.",
          "customer_role": "Admin",
          "context": "Agency service business with multiple team members needing visibility on email interactions.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer requires a way to automate email assignments based on content but finds the current capabilities insufficient.",
          "customer_ask": "Wants to know if there's a way to auto-assign emails based on their content.",
          "customer_role": "Admin",
          "context": "Agency service business dealing with various inquiries that need to be routed to the right team members.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the time it takes to prepare proposals from incoming requests.",
          "customer_ask": "Looking for a solution that can help streamline the proposal preparation process.",
          "customer_role": "Admin",
          "context": "Agency service business that receives numerous development requests requiring detailed proposals.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "07_6948773107252228636",
      "call_id": "6948773107252228636",
      "title": "Hiver Demo | Dineshkumar <> Yukta",
      "started": "2025-12-30T14:59:30+05:30",
      "signals": [
        {
          "problem_statement": "The current IT ticketing process is not standardized, leading to issues being raised without proper prioritization.",
          "customer_ask": "We need a standardized process for the IT ticketing system.",
          "suggested_solution": "Implement an IT ticketing system that allows users to raise tickets based on urgency and priority.",
          "customer_role": "Admin",
          "context": "35 employees, 250 clients, managing IT requests via email.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no portal for clients and employees to raise tickets, leading to reliance on email communication.",
          "customer_ask": "We want a portal for clients and employees to raise tickets.",
          "suggested_solution": "Create a separate tool or portal for ticket submissions.",
          "customer_role": "Admin",
          "context": "35 employees, 250 clients, managing IT requests via email.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not provide visibility to end users regarding the status of their tickets.",
          "customer_ask": "We need a way for end users to see the status of their tickets.",
          "customer_role": "Admin",
          "context": "35 employees, 250 clients, managing IT requests via email.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "08_2119599283047879042",
      "call_id": "2119599283047879042",
      "title": "Hiver Demo | ErikaBlair <> Alex",
      "started": "2025-12-30T20:33:53.636+05:30",
      "signals": [
        {
          "problem_statement": "The customer is struggling to manage support questions efficiently within their community, leading to a hectic workflow.",
          "customer_ask": "I need something to help me and my team organize support questions and answer them efficiently.",
          "customer_role": "Admin",
          "context": "Small team with two community administrators, managing support for financial education courses.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer’s team members are facing challenges logging into multiple Outlook accounts for different jobs.",
          "customer_ask": "This would help them with being able to organize just staying on top of emails.",
          "customer_role": "Admin",
          "context": "Small team with part-time members managing multiple email accounts.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about managing multiple domains and whether they need separate subscriptions for each.",
          "customer_ask": "Would I need two different subscriptions because those are two different apps?",
          "customer_role": "Admin",
          "context": "Managing multiple businesses with different email domains.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is unsure how to effectively utilize the knowledge base feature without sufficient time to create articles.",
          "customer_ask": "We probably won't be using the knowledge base, but none of us have time to create articles.",
          "customer_role": "Admin",
          "context": "Small team with limited resources for content creation.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for a way to allow a team member to monitor support requests without responding to them.",
          "customer_ask": "Is there anything like a light seat for someone who can see but not respond?",
          "customer_role": "Admin",
          "context": "Small team managing support requests.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "08_4705776494156957892",
      "call_id": "4705776494156957892",
      "title": "Hiver Trial Follow Up with Orka.tv",
      "started": "2025-11-03T22:31:50+05:30",
      "signals": [
        {
          "problem_statement": "The customer does not see the value in the product due to the current low volume of emails requiring assignment.",
          "customer_ask": "The customer wants to discuss ideas internally to leverage the tool more effectively.",
          "suggested_solution": "The customer suggested that the product could be more useful when scaling and handling more emails.",
          "customer_role": "CSM",
          "context": "Small team managing email communications with a low volume of actionable emails.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is experiencing issues with the product not being fully utilized due to a lack of need for email assignment.",
          "customer_ask": "The customer is looking for ways to improve internal processes and email management.",
          "suggested_solution": "The customer mentioned wanting to sit down with the team to discuss potential improvements.",
          "customer_role": "CSM",
          "context": "Small team managing email communications with a low volume of actionable emails.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer feels that the product's metrics are not accurate due to a high volume of automated emails.",
          "customer_ask": "The customer is interested in understanding the reporting features better.",
          "suggested_solution": "The customer suggested cleaning out automated emails to improve metric accuracy.",
          "customer_role": "CSM",
          "context": "Small team managing email communications with a mix of automated and manual emails.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "09_5254544859118695564",
      "call_id": "5254544859118695564",
      "title": "Hiver Demo | Justin <> Cole",
      "started": "2025-12-30T21:33:16+05:30",
      "signals": [
        {
          "problem_statement": "The current help desk solution using Monday.com is messy and not meeting the organization's needs.",
          "customer_ask": "Looking for a new help desk solution that is relatively simple.",
          "customer_role": "Admin",
          "context": "Back office of about 30 people and over 1,200 field workers.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not allow for robust form capabilities, leading to issues with ticket routing.",
          "customer_ask": "Need a form that includes dropdowns and conditional elements to ensure correct ticket submission.",
          "suggested_solution": "Implement conditional forms to reduce human error in ticket submissions.",
          "customer_role": "Admin",
          "context": "Back office of about 30 people and over 1,200 field workers.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of automation in routing tickets based on user input, causing tickets to be sent to the wrong place.",
          "customer_ask": "Desire for a system that can automatically route tickets based on dropdown selections rather than free text.",
          "customer_role": "Admin",
          "context": "Back office of about 30 people and over 1,200 field workers.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "09_5721106057272665627",
      "call_id": "5721106057272665627",
      "title": "Hiver Demo with Serenity Kids",
      "started": "2025-11-03T23:31:01+05:30",
      "signals": [
        {
          "problem_statement": "The team lacks visibility on the status of emails and tasks, leading to items slipping through the cracks.",
          "customer_ask": "We need a way to have a double check that the emails are getting processed in a timely manner.",
          "customer_role": "Operations Manager",
          "context": "Growing team managing a high volume of emails related to supply chain and sourcing.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current email management process is inefficient, causing delays in processing important documents like invoices and reports.",
          "customer_ask": "We need a system that categorizes where everything is at in the process.",
          "customer_role": "Operations Manager",
          "context": "Team is distributing the processing of emails and reports among members.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no effective way to manage and track the processing of receipts and invoices, leading to potential oversights.",
          "customer_ask": "We want to categorize and track receipts to ensure none are missed.",
          "customer_role": "Operations Manager",
          "context": "Team handles different receipts and needs a way to manage them efficiently.",
          "confidence": "high"
        },
        {
          "problem_statement": "The team struggles with managing high volumes of emails, leading to confusion and lack of accountability.",
          "customer_ask": "We need a system that allows us to see who is responsible for each email.",
          "customer_role": "Operations Manager",
          "context": "Team is experiencing rapid growth and increased email volume.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "100_6259010085874498720",
      "call_id": "6259010085874498720",
      "title": "Hiver & Megan with Focus for Democracy",
      "started": "2025-11-10T20:55:08+05:30",
      "signals": []
    },
    {
      "transcript_id": "10_4935709220599995484",
      "call_id": "4935709220599995484",
      "title": "Hiver Demo: Ilker <> Cole",
      "started": "2025-11-04T00:03:30+05:30",
      "signals": [
        {
          "problem_statement": "The product does not support consolidating multiple communication channels into one platform.",
          "customer_ask": "I want to see the competitor as well before I make a decision.",
          "suggested_solution": "Develop a solution that consolidates all communication channels.",
          "customer_role": "Admin",
          "context": "Small business with 6-7 employees in insurance and mortgage brokerage.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "10_5959792932057107313",
      "call_id": "5959792932057107313",
      "title": "Hiver Demo | Erika <> Yukta",
      "started": "2025-12-30T21:32:04+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks centralized information from their current tools, leading to inefficiencies.",
          "customer_ask": "We need to improve the experience for our clients.",
          "suggested_solution": "A tool that can unify WhatsApp and email responses.",
          "customer_role": "CSM",
          "context": "Team of 6 to 10 members, using Freshdesk and Response for customer interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer does not have access to important metrics like NPS and customer satisfaction data.",
          "customer_ask": "We need a tool that provides NPS and customer satisfaction metrics.",
          "suggested_solution": "A dashboard that shows customer satisfaction ratings.",
          "customer_role": "CSM",
          "context": "Team of 6 to 10 members, using Freshdesk and Response for customer interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer finds the response time SLA of 24 hours too long and wants to reduce it.",
          "customer_ask": "We need to adjust the response time to maybe four hours.",
          "suggested_solution": "A tool that allows for customizable SLA settings.",
          "customer_role": "CSM",
          "context": "Team of 6 to 10 members, using Freshdesk and Response for customer interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer cannot classify tickets effectively with their current tool.",
          "customer_ask": "We need the ability to classify tickets.",
          "suggested_solution": "A tool that allows for tagging and classifying tickets.",
          "customer_role": "CSM",
          "context": "Team of 6 to 10 members, using Freshdesk and Response for customer interactions.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "11_3175880567959328233",
      "call_id": "3175880567959328233",
      "title": "Hiver Demo | Sam <> Cole",
      "started": "2025-11-04T00:32:25+05:30",
      "signals": [
        {
          "problem_statement": "The customer finds that Google Groups does not work effectively for managing shared inboxes.",
          "customer_ask": "Interested in using Hiver for a shared inbox.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure how to view a specific group inbox instead of their entire mailbox.",
          "customer_ask": "Wants to know how to set up and view a group inbox.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is concerned about the lack of historical email import functionality without additional charges.",
          "customer_ask": "Inquires about importing past emails into the group.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer finds it annoying to set up new user accounts with delegated access.",
          "customer_ask": "Looking for a more efficient way to manage user access.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "12_1745427232507876996",
      "call_id": "1745427232507876996",
      "title": "Hiver Product Demo: Neil<> Matthew",
      "started": "2025-11-04T01:31:10+05:30",
      "signals": [
        {
          "problem_statement": "The current process of using shared mailboxes and subfolders in Microsoft Outlook is inefficient for tracking email assignments and responses.",
          "customer_ask": "We wanted to assess Hiver to see if there might be a good fit there.",
          "customer_role": "Admin",
          "context": "Pharmaceutical organization with multiple business units and 1,300 emails received daily across four shared mailboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for better automation and categorization of incoming emails to improve workflow efficiency.",
          "customer_ask": "It would be good to learn what are the possibilities in Hiver and how we could leverage its capabilities.",
          "customer_role": "Admin",
          "context": "Pharmaceutical organization with multiple business units and 1,300 emails received daily across four shared mailboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks visibility into email handling and response times, which affects their ability to manage customer inquiries effectively.",
          "customer_ask": "Being able to sort of detect long-standing issues would be valuable for us.",
          "customer_role": "Admin",
          "context": "Pharmaceutical organization with multiple business units and 1,300 emails received daily across four shared mailboxes.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is unable to easily test Hiver without connecting an existing shared mailbox, which complicates the trial process.",
          "customer_ask": "I almost just want to test with a test one.",
          "customer_role": "Admin",
          "context": "Pharmaceutical organization looking to pilot Hiver with multiple user accounts.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "13_6700521185384121369",
      "call_id": "6700521185384121369",
      "title": "Hiver Onboarding : Chris<> Yukta",
      "started": "2025-11-04T15:34:00+05:30",
      "signals": [
        {
          "problem_statement": "The customer is limited to creating only three shared mailboxes on their current plan, which is insufficient for their needs.",
          "customer_ask": "The customer implied a need for more than three shared mailboxes.",
          "suggested_solution": "The customer suggested finding workarounds for managing additional email addresses.",
          "customer_role": "Admin",
          "context": "The customer has multiple email addresses that need to be managed but is restricted by the plan limits.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is facing challenges in integrating their Shopify account with the product.",
          "customer_ask": "The customer expressed a desire to set up a Shopify integration.",
          "suggested_solution": "The customer mentioned needing to figure out the setup process for the integration.",
          "customer_role": "Admin",
          "context": "The customer is looking to connect their Shopify account to streamline operations.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "14_5527371625351364325",
      "call_id": "5527371625351364325",
      "title": "Hiver Demo | Talha <> Yukta",
      "started": "2025-11-04T16:29:03+05:30",
      "signals": [
        {
          "problem_statement": "The Hiver Chrome extension is not usable on iPads, limiting functionality for users who rely on iPads.",
          "customer_ask": "Find out if there's any plans to improve the iOS app to add iPad support.",
          "customer_role": "Admin",
          "context": "Team of four using shared inbox and ticketing system, transitioning from Gmail to Google Workspace.",
          "confidence": "high"
        },
        {
          "problem_statement": "The mobile app for iPads only offers a mobile view, which is not very usable for the team.",
          "customer_role": "Admin",
          "context": "Team of four using shared inbox and ticketing system, transitioning from Gmail to Google Workspace.",
          "confidence": "high"
        },
        {
          "problem_statement": "The mobile app does not allow users to mark their availability for email auto-assignment.",
          "customer_role": "Admin",
          "context": "Team of four using shared inbox and ticketing system, transitioning from Gmail to Google Workspace.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "15_6161945918659751659",
      "call_id": "6161945918659751659",
      "title": "Hiver Demo | Asha <> Jeevan",
      "started": "2025-11-04T17:32:35+05:30",
      "signals": [
        {
          "problem_statement": "The KSA team is struggling to manage a single shared inbox for all employee queries, leading to inefficiencies.",
          "customer_ask": "We wanted to reduce this because same emails again and 19 people will read it out.",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of a ticketing system to monitor SLAs and team performance for the KSA operations.",
          "customer_ask": "We wanted to explore how ticketing system works and how we can able to monitor the SLAs and the team performance also through AI automation.",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current email management process does not allow for effective categorization or prioritization of incoming requests.",
          "customer_ask": "We can create a category, right?",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The existing system does not support automation for ticket assignment based on client-specific queries.",
          "customer_ask": "Will the system pick the keywords which is in the mail body, the client name, and assign it by themselves?",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "medium"
        },
        {
          "problem_statement": "There is no integration with existing platforms like Monday.com for managing employee requests.",
          "customer_ask": "Will that be possible? Whatever we are receiving in Monday.com, will that be converted here as a ticket?",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system lacks a customer portal for employees to submit requests, making it difficult to manage incoming queries efficiently.",
          "customer_ask": "Is it possible to connect back on Friday for a quick feedback?",
          "customer_role": "Operations Manager",
          "context": "Team of 19 managing a shared inbox for employee queries.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "16_8207084569033141903",
      "call_id": "8207084569033141903",
      "title": "Hiver Feedback: Nick<> Yukta",
      "started": "2025-11-04T19:00:44+05:30",
      "signals": [
        {
          "problem_statement": "The customer is not seeing order information after setting up the WooCommerce integration.",
          "customer_ask": "The customer wants to see order details in the system.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team size not specified, using WooCommerce integration.",
          "suggested_solution": "The customer implied a need for better syncing or immediate visibility of order details."
        },
        {
          "problem_statement": "The customer has not had enough time to test the chat system and its integration with existing workflows.",
          "customer_ask": "The customer wants to ensure the chat system works smoothly with their existing workflows.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team size not specified, currently testing the chat system.",
          "suggested_solution": "The customer suggested they need to test the workflows before committing to a longer-term plan."
        }
      ]
    },
    {
      "transcript_id": "17_7558156109571095059",
      "call_id": "7558156109571095059",
      "title": "Hiver kick-off",
      "started": "2025-11-04T19:34:39+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unable to effectively manage and prioritize incoming emails due to the limitations of Google Groups, which clogs their inbox with unnecessary stock emails.",
          "customer_ask": "A better solution to manage incoming emails and prioritize customer inquiries.",
          "suggested_solution": "Implement a system that allows for archiving or hiding irrelevant emails to improve visibility for urgent customer requests.",
          "customer_role": "CSM",
          "context": "Team of five managing multiple client inboxes with high email volume.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks visibility into their team's email response rates and overall performance, making it difficult to assess workload and efficiency.",
          "customer_ask": "Tools that provide reporting and visibility into email interactions and team performance.",
          "suggested_solution": "Integrate reporting features that track email responses and workload management.",
          "customer_role": "CSM",
          "context": "Team of five managing multiple client inboxes with high email volume.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer struggles with managing out-of-office coverage effectively, leading to confusion about who is handling specific inquiries.",
          "customer_ask": "A way to manage out-of-office settings that allows for clear visibility of unassigned emails.",
          "suggested_solution": "Automate the unassignment of emails when a team member is out of the office to ensure coverage is clear.",
          "customer_role": "CSM",
          "context": "Team of five managing multiple client inboxes with high email volume.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "18_3304179662683624612",
      "call_id": "3304179662683624612",
      "title": "Hiver Trial Feedback | CDS Repairs",
      "started": "2025-11-04T20:00:50+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unclear about the differences between the pro and elite plans, particularly regarding features and limitations.",
          "customer_ask": "Can you scroll down? What is, what are the main differences?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs AI functionality for their operations, which is not included in the pro plan without an additional cost.",
          "customer_ask": "Is it a must have for you?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the pricing of Hiver compared to a competitor, Drag, which offers a more comprehensive package at a lower price.",
          "customer_ask": "Why are we going with Hiver and not continuous Drag?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer requires skill-based email assignment functionality, which may not be fully supported in the pro plan.",
          "customer_ask": "That's something we definitely would need to have.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "19_2343823255890827207",
      "call_id": "2343823255890827207",
      "title": "Hiver Demo | Joseph <> Cole",
      "started": "2025-11-04T21:01:20+05:30",
      "signals": [
        {
          "problem_statement": "The current email management system is inefficient for handling shared inboxes.",
          "customer_ask": "Looking for something more efficient for a shared email.",
          "customer_role": "IT Director",
          "context": "Small IT team managing support requests for a K-12 school.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for better assignment and tracking of support tickets.",
          "customer_ask": "Easier communication and assignment of tasks.",
          "customer_role": "IT Director",
          "context": "Small IT team managing support requests for a K-12 school.",
          "confidence": "high"
        },
        {
          "problem_statement": "The team lacks visibility into the performance and workload metrics of support requests.",
          "customer_ask": "Understanding performance metrics and workload.",
          "customer_role": "IT Director",
          "context": "Small IT team managing support requests for a K-12 school.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "20_1146939771461552591",
      "call_id": "1146939771461552591",
      "title": "Hiver Trial Follow Up with Bryn",
      "started": "2025-11-04T22:03:26+05:30",
      "signals": [
        {
          "problem_statement": "The AI sentiment analysis is inaccurately categorizing emails, leading to confusion about customer emotions.",
          "customer_ask": "I did find that like we were looking at the AI kind of aspects.",
          "suggested_solution": "Consider improving the accuracy of the AI sentiment analysis.",
          "customer_role": "CSM",
          "context": "Team size not specified, handling client inquiries during month end.",
          "confidence": "high"
        },
        {
          "problem_statement": "The auto-tagging feature is incorrectly tagging emails, causing misclassification of issues.",
          "customer_ask": "I found that it was doing auto tagging, but I thought I had that turned off.",
          "suggested_solution": "Provide better control over the auto-tagging settings.",
          "customer_role": "CSM",
          "context": "Team size not specified, handling various client inquiries.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of clarity in the analytics reporting, specifically regarding how conversations are counted.",
          "customer_ask": "I wasn't sure if you'd be able to answer about the analytics.",
          "suggested_solution": "Enhance the clarity of analytics reporting to better interpret data.",
          "customer_role": "CSM",
          "context": "Team size not specified, sharing analytics with leadership.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "21_4121311404254675775",
      "call_id": "4121311404254675775",
      "title": "Hiver Follow Up with Leah",
      "started": "2025-11-04T23:30:43+05:30",
      "signals": [
        {
          "problem_statement": "Emails that should not appear in the personal inbox are still showing up there despite settings being adjusted.",
          "customer_ask": "Why are emails still showing up in my personal inbox?",
          "customer_role": "Admin",
          "context": "Small team, two users primarily interacting with customers.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for a more efficient way to manage and categorize emails from the design team without cluttering the main inbox.",
          "customer_ask": "Can we automatically move emails from the design team to a specific folder?",
          "suggested_solution": "Create a custom view or folder for design team emails.",
          "customer_role": "Admin",
          "context": "Small team, two users primarily interacting with customers.",
          "confidence": "high"
        },
        {
          "problem_statement": "The email reply box is not functioning properly, causing the entire page to shift and making it difficult to see what is being typed.",
          "customer_ask": "What can be done about the reply box moving while typing?",
          "customer_role": "Admin",
          "context": "Small team, two users primarily interacting with customers.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "22_1900022235445877057",
      "call_id": "1900022235445877057",
      "title": "Hiver Demo",
      "started": "2025-11-05T01:30:29+05:30",
      "signals": [
        {
          "problem_statement": "The customer journey fell off a cliff, indicating a significant breakdown in the customer experience.",
          "customer_ask": "Looking to explore tech stacks and tools before joining a new company.",
          "customer_role": "Unknown",
          "context": "Transitioning between roles, previously managed customer success and support teams.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer expressed concerns about the product's ability to effectively manage customer interactions and data integration with CRM systems.",
          "customer_ask": "Wants to ensure that the product can tie into existing CRM systems effectively.",
          "customer_role": "Unknown",
          "context": "Transitioning between roles, previously managed customer success and support teams.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer noted that the product's custom fields can become obsolete, leading to inefficiencies in data management.",
          "customer_ask": "Desires a more streamlined approach to managing custom fields.",
          "customer_role": "Unknown",
          "context": "Transitioning between roles, previously managed customer success and support teams.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "23_7551637830443202250",
      "call_id": "7551637830443202250",
      "title": "Hiver Demo",
      "started": "2025-11-05T02:02:01+05:30",
      "signals": [
        {
          "problem_statement": "The customer currently lacks a dedicated customer support team and relies on a round-robin email system through Hubspot, which is inefficient.",
          "customer_ask": "They need a better way to manage and track customer interactions.",
          "suggested_solution": "They are looking for a solution that minimizes the number of tools they use.",
          "customer_role": "CSM",
          "context": "Early-stage customer success function with plans to scale.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is dissatisfied with Hubspot and is actively seeking alternatives for better CRM and customer support management.",
          "customer_ask": "They want to explore solutions that provide consistency and analytics.",
          "suggested_solution": "They are interested in a tool that can integrate well with their existing systems.",
          "customer_role": "CSM",
          "context": "Currently using Hubspot for CRM and support.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about their CEO's skepticism towards adopting new tools, which may hinder their ability to implement necessary solutions.",
          "customer_ask": "They need to justify the integration of new tools to their CEO.",
          "suggested_solution": "They are looking for a streamlined solution that can integrate with their existing platforms.",
          "customer_role": "CSM",
          "context": "Facing internal resistance to adopting new tools.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "24_1772088558163387271",
      "call_id": "1772088558163387271",
      "title": "Hiver Introduction with Aperture Education",
      "started": "2025-11-05T03:16:46+05:30",
      "signals": [
        {
          "problem_statement": "The customer is dissatisfied with the current help desk platform, Hubspot's Service Hub, and finds it not well built out.",
          "customer_ask": "The customer is open to considering a switch to a better platform in the future.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of 60-70 people using various support channels including email, chat, and phone."
        },
        {
          "problem_statement": "The customer is looking for a more efficient way to manage support tickets across multiple shared email addresses.",
          "customer_ask": "The customer wants a solution that can handle email, chat, and phone support effectively.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of 60-70 people using various support channels."
        },
        {
          "problem_statement": "The customer is concerned about the lack of native phone support in their current platform, which complicates their workflow.",
          "customer_ask": "The customer is interested in a platform that integrates phone support natively.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team of 60-70 people using various support channels."
        },
        {
          "problem_statement": "The customer needs robust reporting and analytics features to track support performance and response times.",
          "customer_ask": "The customer is looking for reporting features similar to what they currently use.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team of 60-70 people using various support channels."
        }
      ]
    },
    {
      "transcript_id": "25_3473473895190872707",
      "call_id": "3473473895190872707",
      "title": "Hiver Demo | Ya <> Matthew",
      "started": "2025-11-05T05:01:02+05:30",
      "signals": [
        {
          "problem_statement": "The customer receives a high volume of emails daily, with many not requiring a response, leading to inefficiencies in managing their inbox.",
          "customer_ask": "Looking for software to help manage the inbox better and filter out emails that don't need a response.",
          "suggested_solution": "A tool that can help prioritize emails and draft responses for common inquiries.",
          "customer_role": "Senior Accounts Receivable Analyst",
          "context": "Managing an accounts receivable inbox with an average of 100 emails per day.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current email management process is manual and outdated, relying on Gmail delegated access.",
          "customer_ask": "Exploring accounts receivable inbox automation tools to make processes more scalable.",
          "customer_role": "Accounts Receivable Manager",
          "context": "A small team handling accounts receivable emails.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of automation in filtering and tagging emails based on content, which could lead to missed responses.",
          "customer_ask": "Wondering if the system can recognize emails with specific keywords or phrases for automation.",
          "customer_role": "Accounts Receivable Manager",
          "context": "Managing remittance emails and customer inquiries.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The integration with Netsuite is limited to pulling data and does not allow for actions to be taken within Netsuite.",
          "customer_ask": "Interested in understanding how the Netsuite integration works and its capabilities.",
          "customer_role": "Accounts Receivable Manager",
          "context": "Using Netsuite for managing customer data.",
          "confidence": "medium"
        },
        {
          "problem_statement": "There is uncertainty about how to handle emails that contain keywords but require a response, leading to potential mismanagement.",
          "customer_ask": "Clarification on how to ensure important emails are not filtered out by automation.",
          "customer_role": "Senior Accounts Receivable Analyst",
          "context": "Managing customer inquiries related to remittances.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "26_1530539738586496814",
      "call_id": "1530539738586496814",
      "title": "Hiver Onboarding + Team Training",
      "started": "2025-11-05T15:31:34+05:30",
      "signals": [
        {
          "problem_statement": "The customer is experiencing difficulties with screen sharing during the training session.",
          "customer_ask": "Can I have, if I hang on one sec?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team training session with multiple participants"
        },
        {
          "problem_statement": "The customer is unable to locate the Hiver application after logging in.",
          "customer_ask": "I can't bloody find it now.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team training session with multiple participants"
        },
        {
          "problem_statement": "The customer is unclear about the functionality of the tagging system and its limitations.",
          "customer_ask": "Can you take us through the personal settings?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team training session with multiple participants"
        },
        {
          "problem_statement": "The customer is not aware of the advanced functionalities available in the product.",
          "customer_ask": "Do we have the AI features from the record?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Team training session with multiple participants"
        }
      ]
    },
    {
      "transcript_id": "27_5608003571102105784",
      "call_id": "5608003571102105784",
      "title": "Hiver Demo | Abigail <> Rakesh",
      "started": "2025-11-05T16:31:18+05:30",
      "signals": [
        {
          "problem_statement": "The customer service team is currently managing multiple email inboxes, leading to inefficiencies in handling customer queries.",
          "customer_ask": "We need a system in place to combine the inboxes for better organization.",
          "customer_role": "CSM",
          "context": "Team of 4-5 people managing customer service across multiple email addresses.",
          "confidence": "high"
        },
        {
          "problem_statement": "Inquiries from the app are not being tracked effectively, leading to dropped queries.",
          "customer_ask": "We need a way to track inquiries coming from the app.",
          "customer_role": "CSM",
          "context": "Team of 4-5 people managing customer service with inquiries coming from both email and a mobile app.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no current capability to link app communications with the email management system.",
          "customer_ask": "Can we integrate app communications into the email management system?",
          "customer_role": "CSM",
          "context": "Team of 4-5 people managing customer service with inquiries coming from both email and a mobile app.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for a way to categorize and streamline incoming queries through a form on their website.",
          "customer_ask": "Is it possible to set up a form on our website to categorize queries?",
          "customer_role": "CSM",
          "context": "Team of 4-5 people managing customer service with inquiries coming from both email and a mobile app.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "28_2432112143999204582",
      "call_id": "2432112143999204582",
      "title": "Hiver Demo | Jenny <> Yukta",
      "started": "2025-11-05T17:01:17.111+05:30",
      "signals": [
        {
          "problem_statement": "The customer currently manages multiple email addresses alone, leading to potential chaos and duplication as the team expands.",
          "customer_ask": "A smooth way to ensure that everything gets picked up and covered off without duplication.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Small team managing multiple email addresses from contact forms."
        },
        {
          "problem_statement": "The customer does not want a support ticketing system or unnecessary reporting features.",
          "customer_ask": "A simple tool that ensures messages don't get lost or duplicated.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Looking for a straightforward email management solution."
        }
      ]
    },
    {
      "transcript_id": "29_1934531072215400581",
      "call_id": "1934531072215400581",
      "title": "Hiver Demo | Zachary <> Rakesh",
      "started": "2025-11-05T19:30:27+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks a system to manage text messages from users.",
          "customer_ask": "We need to set up a way to manage the texts.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "IT department with about 8 people, handling around 160 emails weekly."
        },
        {
          "problem_statement": "The customer does not have a shared inbox for IT support, leading to inefficient email management.",
          "customer_ask": "Are you open to creating an inbox, which is a common shared inbox?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "IT department with about 8 people, handling around 160 emails weekly."
        },
        {
          "problem_statement": "The customer requires a solution for phone call management, which is currently unsupported.",
          "customer_ask": "Is phone call integration available?",
          "suggested_solution": "Integration with Avaya for phone calls.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "IT department with about 8 people, handling around 160 emails weekly."
        },
        {
          "problem_statement": "The customer needs to export logs and internal notes for audits.",
          "customer_ask": "Is there a way to export those logs or internal notes?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "IT department with about 8 people, handling around 160 emails weekly."
        }
      ]
    },
    {
      "transcript_id": "30_1803620559305344810",
      "call_id": "1803620559305344810",
      "title": "Third Bridge | Hiver Sync",
      "started": "2025-11-05T19:32:43+05:30",
      "signals": [
        {
          "problem_statement": "The customer feels that they are lacking some features that were required for a recent RFP.",
          "customer_ask": "Are you aware of what features they were looking for?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is uncertain about the process for purchasing an AI package and its associated features.",
          "customer_ask": "What would the process be for purchasing the AI package?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is concerned about the pricing of the AI package being a potential barrier to usage.",
          "customer_ask": "Can we negotiate on the pricing?",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "31_5120309415089360841",
      "call_id": "5120309415089360841",
      "title": "Hiver Demo | Erin <> Rakesh",
      "started": "2025-11-05T20:30:27+05:30",
      "signals": [
        {
          "problem_statement": "The customer support team is overwhelmed by the volume of emails, with around 200 emails received daily, leading to inefficiencies in handling queries.",
          "customer_ask": "A system that can deflect repetitive tickets automatically.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no ticketing system in place, making it difficult to track and manage customer queries effectively.",
          "customer_ask": "A ticketing system to manage customer queries.",
          "confidence": "high"
        },
        {
          "problem_statement": "Multiple customer support specialists responding to the same email leads to confusion and inconsistency in customer communication.",
          "customer_ask": "A way to ensure only one person responds to each email.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not allow for clear visibility on who is working on which tickets, leading to potential overlaps and missed responses.",
          "customer_ask": "A system that provides visibility on ticket ownership and status.",
          "confidence": "high"
        },
        {
          "problem_statement": "The team is using password sharing to access a common inbox, which raises security concerns and complicates tracking of individual contributions.",
          "customer_ask": "Individual logins for team members to access the shared inbox.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no effective way to flag and track technical issues reported by customers, leading to delays in addressing these problems.",
          "customer_ask": "A summary or flagging system for recurring technical issues.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "32_8582046139361477789",
      "call_id": "8582046139361477789",
      "title": "Hiver Demo | Jeevan <> Southwest Sales",
      "started": "2025-11-05T21:31:13+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks a ticketing system to track the status of tasks, leading to dropped balls and poor service.",
          "customer_ask": "We need to offer better service and a better experience to our customers.",
          "suggested_solution": "Implement a ticketing system to track task progress.",
          "customer_role": "Sales",
          "context": "Sales team with 20-21 direct reports, B2B interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is excessive manual sorting of emails, which is inefficient for the sales team.",
          "customer_ask": "Automation features to reduce manual sorting.",
          "suggested_solution": "Enhance automation capabilities to streamline email sorting.",
          "customer_role": "Sales",
          "context": "Sales team with 20-21 direct reports, B2B interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not provide adequate analytics to track team performance and workload.",
          "customer_ask": "Access to detailed analytics to monitor team performance.",
          "suggested_solution": "Provide robust analytics features to track workload and performance metrics.",
          "customer_role": "Sales",
          "context": "Sales team with 20-21 direct reports, B2B interactions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer struggles with managing follow-ups and ensuring timely communication with clients.",
          "customer_ask": "A way to track follow-ups and ensure timely updates to customers.",
          "suggested_solution": "Implement features to automate follow-up reminders and status updates.",
          "customer_role": "Sales",
          "context": "Sales team with 20-21 direct reports, B2B interactions.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "33_6393266748416453161",
      "call_id": "6393266748416453161",
      "title": "Hiver Demo | Tyler <> Cole",
      "started": "2025-11-05T22:31:08+05:30",
      "signals": [
        {
          "problem_statement": "The current email management solution using Outlook and Jira does not facilitate effective collaboration and communication.",
          "customer_ask": "Looking for a solution that integrates email management and collaboration.",
          "suggested_solution": "A unified platform that combines email management and collaboration features.",
          "customer_role": "Admin",
          "context": "Team of 15 managing investor relations communications.",
          "confidence": "high"
        },
        {
          "problem_statement": "Lack of visibility into ongoing email conversations leads to missed information when team members are unavailable.",
          "customer_ask": "Need a solution that provides visibility into all email communications.",
          "suggested_solution": "A system that allows team members to see all email threads and conversations.",
          "customer_role": "Admin",
          "context": "Team of 15 managing investor relations communications.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not allow for automated prioritization of incoming requests based on their urgency.",
          "customer_ask": "Interested in AI functionality to prioritize requests automatically.",
          "suggested_solution": "Implementing AI to assess and prioritize incoming emails based on urgency.",
          "customer_role": "Admin",
          "context": "Team of 15 managing investor relations communications.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "34_1070454784834090884",
      "call_id": "1070454784834090884",
      "title": "The Wholistic Pet<>Hiver | Renewal + AI Review",
      "started": "2025-11-05T22:33:22.468+05:30",
      "signals": [
        {
          "problem_statement": "The customer finds the AI features to be hidden and not readily available, leading to underutilization.",
          "customer_ask": "The customer would like more visible suggestions or prompts for using AI features.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Small team managing customer emails"
        },
        {
          "problem_statement": "The customer experiences a workflow breakdown when responding to repetitive customer inquiries due to the lack of efficient template suggestions.",
          "customer_ask": "The customer wants a system that suggests previously used responses for similar inquiries.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Small team managing customer emails"
        },
        {
          "problem_statement": "The customer is confused about the AI capabilities and how to effectively use them, leading to frustration.",
          "customer_ask": "The customer seeks clearer guidance on how to utilize AI features effectively.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Small team managing customer emails"
        },
        {
          "problem_statement": "The customer does not see value in sentiment analysis, indicating it may not be useful for their current email management needs.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Small team managing customer emails"
        }
      ]
    },
    {
      "transcript_id": "35_9113500539911067003",
      "call_id": "9113500539911067003",
      "title": "Hiver Sync",
      "started": "2025-11-06T00:01:17+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs to integrate phone and SMS capabilities into their existing workflows.",
          "customer_ask": "How do we integrate some kind of phone… call, text thing into Hiver?",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "Team size not specified, exploring integration options."
        },
        {
          "problem_statement": "The customer is concerned about ensuring that any new tool has the same capabilities as their current solution.",
          "customer_ask": "We need to make sure anything we potentially move to has the same capability.",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "Team size not specified, evaluating product capabilities."
        },
        {
          "problem_statement": "The customer wants to automate responses regarding order status without human intervention.",
          "customer_ask": "If there was a way that we could automatically see our active admin and then be able to respond that rather than like a human loop being part of that.",
          "confidence": "high",
          "customer_role": "CSM",
          "context": "Team size not specified, focusing on order tracking."
        },
        {
          "problem_statement": "The customer is looking for a way to consolidate various contexts and communication channels into one platform.",
          "customer_ask": "If we could consolidate some of those things, it might be a good one.",
          "confidence": "medium",
          "customer_role": "CSM",
          "context": "Team size not specified, discussing integration with existing systems."
        }
      ]
    },
    {
      "transcript_id": "36_5157230611439883967",
      "call_id": "5157230611439883967",
      "title": "Hiver Meeting with Plaid",
      "started": "2025-11-06T01:02:00+05:30",
      "signals": [
        {
          "problem_statement": "The customer struggles to manage a high volume of emails in the AR inbox, with many emails not requiring a response.",
          "customer_ask": "A tool that can filter out emails that don't need a response.",
          "suggested_solution": "The customer suggested the AI could prioritize emails based on keywords like 'urgent'.",
          "customer_role": "Admin",
          "context": "Managing an AR inbox with an average of 100 emails daily.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned that important emails may get filtered out by the AI.",
          "customer_ask": "A way for the AI to recognize important emails that require attention.",
          "suggested_solution": "The customer suggested that the AI should differentiate between remittance emails and those that contain questions.",
          "customer_role": "Admin",
          "context": "Managing an AR inbox with an average of 100 emails daily.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a more efficient way to retrieve invoice copies from Netsuite.",
          "customer_ask": "To check if the tool can pull invoice copies directly from Netsuite.",
          "suggested_solution": "The customer suggested that the tool should be able to integrate with Netsuite to retrieve invoice copies.",
          "customer_role": "Admin",
          "context": "Managing an AR inbox with an average of 100 emails daily.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "37_5824952077978151925",
      "call_id": "5824952077978151925",
      "title": "Virtue tax <> Hiver AI follow-up session & Renewal",
      "started": "2025-11-06T13:31:13.752+05:30",
      "signals": [
        {
          "problem_statement": "The sentiment analysis feature was not functioning as expected for the customer.",
          "customer_ask": "Can you confirm if the sentiment analysis will work now?",
          "confidence": "high"
        },
        {
          "problem_statement": "The thank you detector feature is perceived as time-consuming for the customer.",
          "customer_ask": "Can this process be automated to save time?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The AI tagging feature requires manual input of tags for initial learning, which is cumbersome.",
          "customer_ask": "Is there a way to simplify the tagging process?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is unclear about how the ask AI feature operates and its benefits.",
          "customer_ask": "Can you provide a clearer example of how ask AI works?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is concerned about the risk of signing a long-term contract without clear benefits.",
          "customer_ask": "What advantages can you offer for a two or three-year contract?",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "38_9191075575686333109",
      "call_id": "9191075575686333109",
      "title": "Hiver Demo | Susie <> Yukta",
      "started": "2025-11-06T14:29:03+05:30",
      "signals": [
        {
          "problem_statement": "The customer is facing difficulties integrating WhatsApp into their current Zendesk setup.",
          "customer_ask": "Looking for options to add WhatsApp to their support system.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Medical clinic with about 10 admin staff using Zendesk."
        },
        {
          "problem_statement": "The customer needs a solution that allows them to initiate WhatsApp messages, which is not supported by the current options.",
          "customer_ask": "Need to be able to initiate messages on WhatsApp.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Medical clinic with about 10 admin staff using Zendesk."
        },
        {
          "problem_statement": "The customer is concerned about the limitations of using Hiver with Outlook, specifically the inability to connect WhatsApp and phone services.",
          "customer_ask": "Exploring the possibility of switching to Google emails to utilize Hiver's full capabilities.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Medical clinic with about 10 admin staff using Zendesk."
        }
      ]
    },
    {
      "transcript_id": "39_4489065961252873757",
      "call_id": "4489065961252873757",
      "title": "Hiver Demo | Larissa <> Rakesh",
      "started": "2025-11-06T14:34:30+05:30",
      "signals": [
        {
          "problem_statement": "It is difficult to track whether emails sent to a single info address have been responded to.",
          "customer_ask": "We want to see how emails get treated and who responded to them.",
          "customer_role": "Admin",
          "context": "Museum with a team of about 10 people managing public inquiries via email.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for statistics on the number of questions answered over the year.",
          "customer_ask": "We want to see statistics over the year, like how many questions we answered.",
          "customer_role": "Admin",
          "context": "Museum with a team of about 10 people managing public inquiries via email.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current email management solution does not provide sufficient visibility into email workload distribution among team members.",
          "customer_ask": "How is there a possibility to follow up for me as a manager?",
          "customer_role": "Admin",
          "context": "Museum with a team of about 10 people managing public inquiries via email.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "40_5889162012071059252",
      "call_id": "5889162012071059252",
      "title": "Hiver Sync and Update on Cyber Security",
      "started": "2025-11-06T15:15:51+05:30",
      "signals": []
    },
    {
      "transcript_id": "41_6038424334974915070",
      "call_id": "6038424334974915070",
      "title": "Hiver Onboarding <> Kick off",
      "started": "2025-11-06T16:31:12.408+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unsure about the user setup and whether shared mailboxes are consuming user seats unnecessarily.",
          "customer_ask": "Clarification on whether the business account needs to be a user or can just be a shared mailbox.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Team size not specified, managing multiple inboxes."
        },
        {
          "problem_statement": "The customer is facing limitations in automating the classification of contacts based on their email domains.",
          "customer_ask": "A way to automatically classify contacts into categories like individual inquiries and corporate inquiries.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Managing customer inquiries and marketing outreach."
        },
        {
          "problem_statement": "The customer is experiencing issues with the analytics feature, specifically regarding the visibility of data due to account suspension.",
          "customer_ask": "Access to analytics to track inquiries and sales.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Tracking performance metrics for tours."
        },
        {
          "problem_statement": "The customer is unable to automate the export of contacts with associated tags, leading to manual work.",
          "customer_ask": "An automated way to export contacts with their tags.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Managing contact information for marketing purposes."
        }
      ]
    },
    {
      "transcript_id": "42_6164406999499399669",
      "call_id": "6164406999499399669",
      "title": "Gasera <> Hiver : Trial Feedback",
      "started": "2025-11-06T17:30:23+05:30",
      "signals": [
        {
          "problem_statement": "When responding to emails from the support address, team members cannot see their sent messages in their inbox or sent mail.",
          "customer_ask": "Clarification on how to track emails sent from the support address.",
          "customer_role": "Support Lead",
          "context": "Small team using the tool for customer support",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer had difficulty locating the shared comment feature when needed.",
          "customer_ask": "Help in finding the shared comment feature.",
          "customer_role": "Support Lead",
          "context": "Small team using the tool for customer support",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "43_7358947301194959400",
      "call_id": "7358947301194959400",
      "title": "Hiver Sync",
      "started": "2025-11-06T18:32:42+05:30",
      "signals": [
        {
          "problem_statement": "The customer cannot assign an email to more than one person, which limits collaboration on shared tasks.",
          "customer_ask": "Is there any way that we can assign an email to more than one person?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer cannot access the spam folder from their individual inboxes, which may lead to missed important emails.",
          "customer_ask": "Is there any way to add the spam folder into my own inbox with the HR section?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer cannot edit tag names once created, which restricts their ability to organize and manage tags effectively.",
          "customer_ask": "I just wondered if there is any way to amend what the tag was called.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer needs an automatic reply setup for emails assigned to a part-time employee to inform senders of potential delays.",
          "customer_ask": "Is there any kind of way that we could get an automatic reply set up for anything that gets assigned to Jen?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer wants to see pending emails more prominently in their interface, indicating a need for better visibility of important tasks.",
          "customer_ask": "Would it be possible to move pending up so that we can see it on that first page?",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "44_3896480921453114404",
      "call_id": "3896480921453114404",
      "title": "Hiver & John with Printville",
      "started": "2025-11-06T19:11:14+05:30",
      "signals": [
        {
          "problem_statement": "The customer is not utilizing all features of the current plan and feels they are overpaying for unused capabilities.",
          "customer_ask": "To continue using Hiver at the same rate without a significant price increase.",
          "suggested_solution": "A minimal price increase of one dollar per user per month.",
          "customer_role": "Admin",
          "context": "Team of 14 users, primarily using basic features.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the potential price increase and its impact on their decision to renew.",
          "customer_ask": "To honor the current pricing or keep the increase minimal.",
          "suggested_solution": "To negotiate a lower price increase.",
          "customer_role": "Admin",
          "context": "Team of 14 users, primarily using basic features.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "45_3769740830625009605",
      "call_id": "3769740830625009605",
      "title": "Hiver Demo | Oliver <> Yukta",
      "started": "2025-11-06T19:31:54+05:30",
      "signals": []
    },
    {
      "transcript_id": "46_1685282307001139557",
      "call_id": "1685282307001139557",
      "title": "Hiver & Arden with Lifeworksot",
      "started": "2025-11-06T19:39:35+05:30",
      "signals": []
    },
    {
      "transcript_id": "47_5712193747321677237",
      "call_id": "5712193747321677237",
      "title": "Hiver & Victor with The Casumo Company Limited (AI Addon)",
      "started": "2025-11-06T20:00:07+05:30",
      "signals": [
        {
          "problem_statement": "The AI tagging feature may not effectively handle multiple languages, which is crucial for the finance department that deals with invoices in different languages.",
          "customer_ask": "How can we teach Hiver to understand several languages at the same time?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Finance department handling 30-50 emails daily in multiple languages",
          "suggested_solution": "Implement AI tagging that can recognize and categorize emails based on different languages."
        },
        {
          "problem_statement": "The current system requires manual intervention to sort emails by language, which is inefficient.",
          "customer_ask": "Can AI tagging be used for language specificity to automatically assign emails to the right team member?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Finance department with team members fluent in different languages",
          "suggested_solution": "Use AI tagging to automatically assign emails based on the language detected."
        },
        {
          "problem_statement": "The team struggles with managing and documenting processes effectively, leading to inefficiencies.",
          "customer_ask": "How can we centralize our knowledge and processes to make them more accessible?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Finance department with scattered documentation across different platforms",
          "suggested_solution": "Utilize the co-pilot feature to consolidate and streamline process documentation."
        }
      ]
    },
    {
      "transcript_id": "48_7768713414820477796",
      "call_id": "7768713414820477796",
      "title": "Hiver Sandbox Sync",
      "started": "2025-11-06T20:47:25+05:30",
      "signals": [
        {
          "problem_statement": "The integration between Hiver and Outlook does not support email deletion synchronization.",
          "customer_ask": "Confirmation on whether deleting an email in Hiver will also delete it in Outlook.",
          "customer_role": "Admin",
          "context": "Public institution, evaluating integration with existing systems.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer requires detailed security and technical feasibility information for Hiver's integration with Outlook.",
          "customer_ask": "Request for documents or information to provide to the IT team regarding security risks and access requirements.",
          "customer_role": "Admin",
          "context": "Public institution, needs to comply with thorough IT review processes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is uncertain about the timeline for accessing the sandbox environment for testing.",
          "customer_ask": "Request for extended access to the sandbox until the end of the day tomorrow.",
          "customer_role": "Admin",
          "context": "Public institution, team needs more time to test the platform.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "49_4967298708131430806",
      "call_id": "4967298708131430806",
      "title": "Hiver & Nancy with Maze Media Ltd",
      "started": "2025-11-06T21:03:26+05:30",
      "signals": [
        {
          "problem_statement": "The customer is looking for ways to improve efficiency in their processes and systems.",
          "customer_ask": "Are there ways in which we can be more efficient with our systems?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Marketing agency with a focus on finance and accounts"
        },
        {
          "problem_statement": "The customer is unsure about the capabilities of the AI features and how they can be applied to their current workflows.",
          "customer_ask": "Can you explain how the AI features can be applied to our current workflows?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Marketing agency with a focus on finance and accounts"
        },
        {
          "problem_statement": "The customer is concerned about the potential costs associated with upgrading to the AI features.",
          "customer_ask": "Is there a free trial available to test the features?",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Marketing agency with a focus on finance and accounts"
        }
      ]
    },
    {
      "transcript_id": "50_2968242996037638571",
      "call_id": "2968242996037638571",
      "title": "Hiver AI for Pattern",
      "started": "2025-11-06T21:44:48+05:30",
      "signals": [
        {
          "problem_statement": "The AI tagging system inaccurately applies tags, leading to confusion and inefficiency.",
          "customer_ask": "Is there any way to report when a tag is not applied when it should have been?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer experiences failures when trying to report tagging issues through the interface.",
          "customer_ask": "Can you fix the issue where it says 'fail to report tag'?",
          "confidence": "high"
        },
        {
          "problem_statement": "The AI requires significant training time (1-2 weeks) to function effectively, which delays its usefulness.",
          "customer_ask": "Can we expedite the training process for the AI?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The AI's ability to learn from varied email content is limited, making it difficult to apply tags accurately.",
          "customer_ask": "Can the AI be improved to better handle diverse email content?",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "51_1949955582615015228",
      "call_id": "1949955582615015228",
      "title": "Hiver & Desiree Fuentes with",
      "started": "2025-11-06T21:35:53+05:30",
      "signals": []
    },
    {
      "transcript_id": "52_7765196998698818288",
      "call_id": "7765196998698818288",
      "title": "Hiver Demo | Daniel <> Cole",
      "started": "2025-11-06T22:05:49+05:30",
      "signals": [
        {
          "problem_statement": "The current use of a Google group for managing shared mailboxes is ineffective, leading to communication issues and potential oversight of customer interactions.",
          "customer_ask": "A shared mailbox for sales that allows better visibility and management of communications.",
          "customer_role": "Owner",
          "context": "Wildlife removal company with plans to expand from three to six employees.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for better integration between Hiver and Housecall Pro to streamline customer management and job tracking.",
          "customer_ask": "Integration opportunities between Hiver and Housecall Pro.",
          "customer_role": "Owner",
          "context": "Wildlife removal company using Housecall Pro for field service management.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The current notification system for tagged messages in Hiver is insufficient, as team members may miss notifications unless they are actively checking the platform.",
          "customer_ask": "A chat bot that notifies team members when they are tagged in a thread.",
          "customer_role": "Owner",
          "context": "Wildlife removal company with a team trained on Google Chat.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The sales team struggles with documentation and note-taking during customer interactions, which could lead to gaps in customer service.",
          "customer_ask": "A solution that encourages better documentation practices among sales staff.",
          "customer_role": "Owner",
          "context": "Wildlife removal company with a sales team that has issues with keeping up with documentation.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "53_3947310817572786406",
      "call_id": "3947310817572786406",
      "title": "Hiver Demo Somerset County Educational Services Commission<> Cole",
      "started": "2025-11-06T22:31:46+05:30",
      "signals": [
        {
          "problem_statement": "The customer is limited in their ability to streamline workflows and tags due to a legacy plan with Helpscout.",
          "customer_ask": "They are looking to see if Hiver can solve some of the issues they are currently facing and be more efficient.",
          "customer_role": "Admin",
          "context": "Special education transportation department with a significant budget increase and a growing number of users.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer cannot create or manage company profiles effectively, leading to difficulties in handling multiple contacts from the same organization.",
          "customer_ask": "They want to know if Hiver can allow them to create company profiles.",
          "suggested_solution": "The customer suggested that they need company profiles for better organization.",
          "customer_role": "Admin",
          "context": "Managing multiple contacts from various districts and transportation companies.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the limitations on the number of recipients for outgoing emails, which could affect their communication with contractors and districts.",
          "customer_ask": "They need clarification on whether Hiver has a limit on the number of recipients for outgoing emails.",
          "customer_role": "Admin",
          "context": "Sending emails to contractors and districts for important information.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for a way to set reminders or timers on emails to ensure follow-ups are not missed.",
          "customer_ask": "They want to know if they can set a timer for emails to pop back up in the queue.",
          "suggested_solution": "The customer suggested having a feature to remind them to follow up on emails.",
          "customer_role": "Admin",
          "context": "Managing follow-ups with contractors regarding student information.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "54_5832822436037059608",
      "call_id": "5832822436037059608",
      "title": "Hiver Demo | Sean <> Cole",
      "started": "2025-11-06T23:30:49+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs a ticketing software to track onboarding and offboarding processes but finds the current product lacks asset management features.",
          "customer_ask": "A system that generates tasks or child tickets for onboarding and offboarding.",
          "suggested_solution": "A more comprehensive project management or service desk solution that includes asset management.",
          "customer_role": "IT Director",
          "context": "Small company with about 150 end users.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for a simplistic trouble tracking system but is unsure if the product fits their needs.",
          "customer_ask": "Clarification on whether the product can serve as a service desk.",
          "suggested_solution": "A solution that combines ticket management with project management capabilities.",
          "customer_role": "IT Director",
          "context": "Small company with about 150 end users.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "55_5498142965980726726",
      "call_id": "5498142965980726726",
      "title": "Hiver Demo | Emily <> Jeevan",
      "started": "2025-11-06T23:32:19+05:30",
      "signals": [
        {
          "problem_statement": "The splitting of inboxes caused workflow disruptions for the customer.",
          "customer_ask": "They want to try using the product again properly.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer has multiple shared inboxes and finds it cumbersome to manage them separately.",
          "customer_ask": "They would like to know if it's possible to consolidate all shared inboxes into one.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer expressed a need for better visibility and tracking of email assignments and statuses.",
          "customer_ask": "They want to ensure they can see all assigned emails and their statuses easily.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is concerned about the integration capabilities with their existing systems, specifically Acumatica.",
          "customer_ask": "They want to know if there is integration with Acumatica.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "56_902598329924121265",
      "call_id": "902598329924121265",
      "title": "Hiver pricing sync",
      "started": "2025-11-07T00:32:33+05:30",
      "signals": [
        {
          "problem_statement": "The entry-level plan does not support shared inboxes, which is a limitation for the customer.",
          "customer_ask": "Clarification on the number of shared mailboxes supported by different plans.",
          "customer_role": "Admin",
          "context": "Considering options for shared inboxes for a team.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is exploring alternatives to Hiver due to limitations in shared mailbox capabilities.",
          "customer_ask": "Looking into Google's shared mailbox options.",
          "customer_role": "Admin",
          "context": "Comparing Hiver with Google Workspace for shared inbox functionality.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "57_2465563737737913140",
      "call_id": "2465563737737913140",
      "title": "Hiver Demo | Tristian <> Cole",
      "started": "2025-11-07T02:44:31+05:30",
      "signals": [
        {
          "problem_statement": "The customer lacks a centralized way to track owner inbound messages across multiple platforms, leading to potential missed communications.",
          "customer_ask": "A way to track owner messages that haven't been responded to in the last 24 hours.",
          "suggested_solution": "A centralized interface within Hiver to see all communications for owners, tenants, and vendors in an organized fashion.",
          "customer_role": "Property Manager",
          "context": "Property management company with seven active team members managing 170 doors.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about team members responding to the same email without awareness of each other's actions.",
          "customer_ask": "A solution to prevent multiple responses to the same tenant email.",
          "suggested_solution": "A feature that allows tracking of email responses to avoid duplication.",
          "customer_role": "Property Manager",
          "context": "Property management company with seven active team members managing 170 doors.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs internal communication capabilities to replace Slack.",
          "customer_ask": "A feature for internal communications within the platform.",
          "suggested_solution": "An all-in-one platform that includes internal communication features.",
          "customer_role": "Operations System Strategy Manager",
          "context": "Property management company with seven active team members managing 170 doors.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer requires a way to track KPIs related to response times for owners and tenants.",
          "customer_ask": "The ability to pull reports for KPI purposes.",
          "suggested_solution": "A feature that allows tracking and reporting of response times.",
          "customer_role": "Operations System Strategy Manager",
          "context": "Property management company with seven active team members managing 170 doors.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the potential complexity and learning curve of the new software.",
          "customer_ask": "A system that is easy to learn and not overly complex.",
          "suggested_solution": "A simplified interface that reduces clutter and complexity.",
          "customer_role": "Property Manager",
          "context": "Property management company with seven active team members managing 170 doors.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "58_5263166639052428378",
      "call_id": "5263166639052428378",
      "title": "Hiver Meeting",
      "started": "2025-11-07T14:31:48+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs a form for pickup requests that allows customers to fill out specific information.",
          "customer_ask": "Can hiver create a form for pickup requests?",
          "suggested_solution": "A form that customers can fill out to create an email request.",
          "customer_role": "Admin",
          "context": "Team of 6-7 people managing multiple mailboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the safety and privacy of their emails when using the product.",
          "customer_ask": "How is the safety of emails managed?",
          "suggested_solution": "Clarification on email security and compliance.",
          "customer_role": "Admin",
          "context": "Team of 6-7 people managing multiple mailboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer requires the product interface to support the German language.",
          "customer_ask": "Is there an option to switch to German?",
          "suggested_solution": "Provide a German interface option for the product.",
          "customer_role": "Admin",
          "context": "Team of 6-7 people managing multiple mailboxes.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "59_880109070710881970",
      "call_id": "880109070710881970",
      "title": "Hiver AI & Jon with Docto",
      "started": "2025-11-07T14:32:22+05:30",
      "signals": [
        {
          "problem_statement": "The current tagging system does not adequately capture the variety of ways customers phrase their inquiries, leading to potential misclassification.",
          "customer_ask": "We would like a more flexible tagging system that can understand different phrases for similar requests.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Admin team of about five managing inbound emails for a telehealth medical service."
        },
        {
          "problem_statement": "There is a lack of automation in responding to customer inquiries, requiring manual review of all responses.",
          "customer_ask": "We need a system that can suggest responses based on previous interactions.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Admin team of about five managing inbound emails for a telehealth medical service."
        },
        {
          "problem_statement": "The current system does not provide a way to automatically extract and surface important information like invoice numbers from emails.",
          "customer_ask": "We would like a feature that can extract specific data from emails and display it prominently.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Admin team of about five managing inbound emails for a telehealth medical service."
        }
      ]
    },
    {
      "transcript_id": "60_7353414352892152204",
      "call_id": "7353414352892152204",
      "title": "Hiver<> bamboopayment",
      "started": "2025-11-07T15:02:06+05:30",
      "signals": [
        {
          "problem_statement": "Zendesk is perceived as an expensive tool that requires extensive setup and configuration, making it difficult for the team to utilize its full capacity.",
          "customer_ask": "Looking for a tool that allows automation and connects with internal documentation.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        },
        {
          "problem_statement": "The current setup in Zendesk is complicated, requiring significant time and technical expertise to manage workflows and automations.",
          "customer_ask": "Desires a solution that is simple and easy to operate without needing a dedicated person for setup.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        },
        {
          "problem_statement": "There is a lack of intuitive AI features in Zendesk, which are offered as additional paid services rather than included by default.",
          "customer_ask": "Wants an AI-powered solution that does not require extra payments for basic functionalities.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        },
        {
          "problem_statement": "The process of managing chargebacks through Zendesk is cumbersome and not fully automated, requiring manual intervention.",
          "customer_ask": "Looking for a more efficient automation process that integrates seamlessly with their existing workflows.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        },
        {
          "problem_statement": "The current analytics and reporting capabilities in Zendesk are perceived as complicated and not user-friendly.",
          "customer_ask": "Wants a solution that allows easy access to KPIs and dashboard creation.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        },
        {
          "problem_statement": "The need for a customer portal in Zendesk requires complex programming, making it inaccessible for the team.",
          "customer_ask": "Desires a simpler way to set up a customer portal without extensive technical knowledge.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Payments processing company with a small team."
        }
      ]
    },
    {
      "transcript_id": "61_2529682253429226658",
      "call_id": "2529682253429226658",
      "title": "Hiver<> Piceci Services",
      "started": "2025-11-07T17:30:36.131+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs a shared inbox solution for freelancers to communicate with clients using a single email address.",
          "customer_ask": "We need a shared inbox like a shared email.",
          "suggested_solution": "Remove the requirement for freelancers to have Google Workspace email IDs.",
          "customer_role": "Admin",
          "context": "Team managing freelancers for client communication.",
          "confidence": "high"
        },
        {
          "problem_statement": "Freelancers cannot send emails as the company's domain due to Google Workspace limitations.",
          "customer_ask": "Find a solution that allows freelancers to communicate without needing their own Google Workspace email IDs.",
          "suggested_solution": "Enable freelancers to use a shared email ID for client communication.",
          "customer_role": "Admin",
          "context": "Team managing freelancers for client communication.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "62_5063150964855671922",
      "call_id": "5063150964855671922",
      "title": "Hiver <> Genesis Media Limited - AI Feature Commercials",
      "started": "2025-11-07T17:31:51+05:30",
      "signals": [
        {
          "problem_statement": "The AI compose feature is underutilized by team members despite its usefulness to some individuals.",
          "customer_ask": "Suggestions on how to encourage team members to use AI compose.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer needs a tool that can review legal agreements and contracts, which is a significant part of their work.",
          "customer_ask": "A feature that allows uploading agreements for review against organizational norms and legal requirements.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current task management process is fragmented, with team members using different methods and tools.",
          "customer_ask": "Integration of task management features into Hiver to centralize task handling.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks a centralized system for handling incoming legal requests, relying solely on email.",
          "customer_ask": "A structured way to manage incoming requests through Hiver.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "63_7968688745761658790",
      "call_id": "7968688745761658790",
      "title": "Hiver Demo | Chloe <> Yukta",
      "started": "2025-11-07T18:28:31.304+05:30",
      "signals": [
        {
          "problem_statement": "The customer is struggling with the distribution of emails among team members using Gmail's shared inbox, which is not effective for their needs.",
          "customer_ask": "Looking for a system that allows appropriate delegation of emails.",
          "suggested_solution": "A central command to see all emails and mark them as being worked on in real time.",
          "customer_role": "Admin",
          "context": "Small team of 3-4 people managing household-related emails.",
          "confidence": "high"
        },
        {
          "problem_statement": "Emails are being duplicated across personal and shared inboxes, leading to inefficiencies.",
          "customer_ask": "A solution to avoid duplicating work and manage emails more effectively.",
          "suggested_solution": "A way to manage emails without them being forwarded to personal inboxes.",
          "customer_role": "Admin",
          "context": "Small team of 3-4 people managing household-related emails.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a way to track who is handling which emails to avoid confusion and ensure accountability.",
          "customer_ask": "A system that shows who is working on what email.",
          "suggested_solution": "Visibility into email assignments and the ability to reassign emails when necessary.",
          "customer_role": "Admin",
          "context": "Small team of 3-4 people managing household-related emails.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "64_4243852835283383400",
      "call_id": "4243852835283383400",
      "title": "Hiver & Naima with",
      "started": "2025-11-07T19:24:55+05:30",
      "signals": [
        {
          "problem_statement": "The AI tagging feature is not functioning as expected, causing confusion in setup.",
          "customer_ask": "I really don't understand how am I supposed to set it up?",
          "confidence": "high"
        },
        {
          "problem_statement": "The thank you detector is not closing tickets as it should when receiving thank you messages.",
          "customer_ask": "I was wondering if there's something I can add to it like if it says thank you right now.",
          "confidence": "high"
        },
        {
          "problem_statement": "The integration with Asana lacks customization options, making it difficult to create tickets efficiently.",
          "customer_ask": "Is there a way I can create tickets from here?",
          "suggested_solution": "I was thinking of using Zapier between Asana and Hiver.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current ticket creation process does not allow for necessary fields and attachments, limiting functionality.",
          "customer_ask": "Is there a way I can understand if I'm not generating my ticket from here on Asana?",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for a more streamlined autoresponder setup to handle incoming emails efficiently.",
          "customer_ask": "I was wondering if I should have automated replies to everybody who sends it in an email.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "65_1799444064847399580",
      "call_id": "1799444064847399580",
      "title": "Hiver Test Account Set up",
      "started": "2025-11-07T19:34:19+05:30",
      "signals": [
        {
          "problem_statement": "The customer is experiencing significant manual tasks in Outlook, leading to a lack of transparency and visibility on ticket ownership and email responses.",
          "customer_ask": "A better solution to manage transparency and visibility on tickets and emails.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Sales team managing multiple email domains and shared mailboxes."
        },
        {
          "problem_statement": "The customer is unable to access their sales mailbox due to third-party application restrictions set by their Microsoft admin.",
          "customer_ask": "Assistance in whitelisting Hiver in their Microsoft account.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Sales team managing multiple email domains and shared mailboxes."
        },
        {
          "problem_statement": "The customer is unsure how to sync past emails into Hiver, as it requires engineering work to import older emails.",
          "customer_ask": "Clarification on the process to import older emails into Hiver.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Sales team managing multiple email domains and shared mailboxes."
        },
        {
          "problem_statement": "The customer wants to create custom statuses for their email management workflow but is limited by the inability to customize default statuses in Hiver.",
          "customer_ask": "The ability to create custom statuses for email management.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Sales team managing multiple email domains and shared mailboxes."
        }
      ]
    },
    {
      "transcript_id": "66_8554135351031083585",
      "call_id": "8554135351031083585",
      "title": "Hiver & Desiree with Cirrus Payroll",
      "started": "2025-11-07T20:00:54+05:30",
      "signals": [
        {
          "problem_statement": "The AI add-on package is only available as a full suite, which may not be cost-effective for all team members.",
          "customer_ask": "Consider offering the AI features a la carte.",
          "customer_role": "Admin",
          "context": "Team size not specified, but includes payroll and implementation teams.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for better tracking of client communication sentiment to improve client retention.",
          "customer_ask": "Enhance sentiment tracking capabilities.",
          "customer_role": "Admin",
          "context": "Team size not specified, focused on client interactions.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "67_2571136605912954864",
      "call_id": "2571136605912954864",
      "title": "Hiver Trial Set Up",
      "started": "2025-11-07T20:51:07+05:30",
      "signals": [
        {
          "problem_statement": "The customer is concerned about the limitations of user licenses when setting up their trial account.",
          "customer_ask": "Clarification on whether they can add more users without exceeding their license limit.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about the process of integrating chat functionality into their website.",
          "customer_ask": "How to implement chat on their website.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is facing difficulties with collaboration features, specifically regarding external users accessing shared inboxes.",
          "customer_ask": "How to invite external users to collaborate on emails.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for a way to automate follow-up emails for pending requests.",
          "customer_ask": "Can they set up automated reminders for emails that haven't received a response?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the lack of differentiation in handling emails for different terminals.",
          "customer_ask": "How to manage emails specific to different terminals effectively.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "68_4113860263497002780",
      "call_id": "4113860263497002780",
      "title": "Hiver & Nick with MVS Canada Logistics - Ship Your Car With The Experts",
      "started": "2025-11-07T20:31:44+05:30",
      "signals": [
        {
          "problem_statement": "The AI extract feature is not functioning as expected, limiting the customer's ability to confirm and proceed with automation.",
          "customer_ask": "Interested in understanding how the AI features work and if there are other features that could improve their use case.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Small logistics team managing multiple email workflows."
        },
        {
          "problem_statement": "The customer is unsure about how to set up multiple shared inboxes and whether they need to duplicate automations for each inbox.",
          "customer_ask": "Clarification on how to manage multiple email addresses without creating separate inboxes.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Small logistics team managing multiple email workflows."
        },
        {
          "problem_statement": "The customer is facing limitations in extracting specific data (like phone numbers and VINs) from emails, which affects their operational efficiency.",
          "customer_ask": "Ability to extract phone numbers and VINs using an API.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Small logistics team managing multiple email workflows."
        }
      ]
    },
    {
      "transcript_id": "69_8319358155378002711",
      "call_id": "8319358155378002711",
      "title": "Hiver Demo | Chip <> Cole",
      "started": "2025-11-07T20:31:00+05:30",
      "signals": [
        {
          "problem_statement": "The current system lacks a simple way to track customer inquiries and escalate them to a support ticket.",
          "customer_ask": "We want a simple system to be able to track that and know when someone needs help.",
          "customer_role": "CEO",
          "context": "Small team handling customer inquiries related to classes for young adults and juveniles.",
          "confidence": "high"
        },
        {
          "problem_statement": "The existing AI chatbot does not effectively differentiate between distinct user populations, leading to inappropriate responses.",
          "customer_ask": "We need to distinguish what kind of user the customer is and answer appropriately.",
          "customer_role": "Director of Operations",
          "context": "Multiple user types including adult learners, juvenile learners, and court staff.",
          "confidence": "high"
        },
        {
          "problem_statement": "The complexity of the current system's trigger paths is causing issues in providing accurate responses.",
          "customer_ask": "We need to simplify the process of creating conversational triggers.",
          "customer_role": "Director of Operations",
          "context": "Struggling with complex trigger paths for different user types.",
          "confidence": "medium"
        },
        {
          "problem_statement": "There is a need for a generative AI feature to enhance customer interactions, but it is not yet available.",
          "customer_ask": "We need the generative AI to feel like customers are talking to a person.",
          "customer_role": "CEO",
          "context": "Looking for a solution that can handle customer inquiries effectively as they scale.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "70_7894666056939405593",
      "call_id": "7894666056939405593",
      "title": "Hiver Trial Set Up",
      "started": "2025-11-07T20:51:07+05:30",
      "signals": [
        {
          "problem_statement": "The customer is concerned about the limitations of user licenses when setting up their trial account.",
          "customer_ask": "Clarification on whether they can use a Google group instead of individual user licenses.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about the process for setting up chat functionality on their website.",
          "customer_ask": "How does the chat work and if it needs to be implemented on their website first?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for a way to manage emails related to specific terminals effectively.",
          "customer_ask": "How to handle emails that are specific to certain terminals?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about the lack of a mobile application for managing emails.",
          "customer_ask": "Is there a phone app or extension available?",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is facing issues with collaboration features, specifically when trying to invite external users.",
          "customer_ask": "How to invite someone outside their domain for collaboration?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for a way to automate follow-up emails for pending requests.",
          "customer_ask": "Can they set up automated follow-ups for emails that haven't received a response?",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "71_236128162399131925",
      "call_id": "236128162399131925",
      "title": "Hiver Trial Sync",
      "started": "2025-11-07T21:31:03+05:30",
      "signals": []
    },
    {
      "transcript_id": "72_8303457519254880340",
      "call_id": "8303457519254880340",
      "title": "Hiver Demo | Liza <> Cole",
      "started": "2025-11-07T22:30:29+05:30",
      "signals": [
        {
          "problem_statement": "The customer experiences issues with automated emails creating separate tickets instead of merging them into one thread.",
          "customer_ask": "Is there any way to combine them into a merged item?",
          "suggested_solution": "A feature to automatically merge duplicate tickets from automated systems.",
          "customer_role": "Product Manager",
          "context": "Small support team managing client inquiries and tech tickets.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about the ability to customize ticket statuses beyond the default options.",
          "customer_ask": "Can we add new statuses or do we only have those three?",
          "suggested_solution": "The ability to create custom statuses for better ticket management.",
          "customer_role": "Product Manager",
          "context": "Small support team managing client inquiries and tech tickets.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is concerned about the visibility of system-generated tags in the email interface.",
          "customer_ask": "Should the team avoid removing system-generated tags?",
          "suggested_solution": "Clear guidance on the importance of not removing system-generated tags.",
          "customer_role": "Product Manager",
          "context": "Small support team managing client inquiries and tech tickets.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "73_5936591522611905187",
      "call_id": "5936591522611905187",
      "title": "Hiver & Jesse with Earnest Homes",
      "started": "2025-11-07T22:32:19+05:30",
      "signals": [
        {
          "problem_statement": "The AI copilot settings change unexpectedly, causing it to become disabled without user action.",
          "customer_ask": "To understand why the settings change and ensure they remain enabled.",
          "customer_role": "Support Lead",
          "context": "Team size not specified, using AI features.",
          "confidence": "high"
        },
        {
          "problem_statement": "The AI copilot does not assist in composing new emails, limiting its functionality for users who want to draft emails from knowledge base information.",
          "customer_ask": "To have the copilot assist in composing new emails using information from the knowledge base.",
          "suggested_solution": "To allow the copilot to create drafts for new emails.",
          "customer_role": "Support Lead",
          "context": "Team size not specified, using AI features.",
          "confidence": "high"
        },
        {
          "problem_statement": "The AI sentiment analysis feature is not useful for the customer's business context, leading to dissatisfaction with the overall AI package.",
          "customer_ask": "To reconsider the pricing structure based on the features they actually use.",
          "customer_role": "Sales",
          "context": "Team size not specified, evaluating AI features.",
          "confidence": "medium"
        },
        {
          "problem_statement": "There is uncertainty about the AI's language preference settings, specifically whether it uses American or British English.",
          "customer_ask": "To clarify if there is an option to select the language preference for AI responses.",
          "customer_role": "Sales",
          "context": "Team size not specified, evaluating AI features.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "74_9120382904616406833",
      "call_id": "9120382904616406833",
      "title": "Hiver & Nick with Rêve",
      "started": "2025-11-07T23:00:32+05:30",
      "signals": [
        {
          "problem_statement": "The AI feature for recognizing thank yous is not functioning as expected.",
          "customer_ask": "I was going to add this, the AI thing that's supposed to recognize thank yous and does not work.",
          "confidence": "high"
        },
        {
          "problem_statement": "The knowledge base lacks article ownership and a review cadence.",
          "customer_ask": "I almost have to create hyperlinks into... I have to put all the articles into hiver.",
          "suggested_solution": "Have an approver effectively like a review approver and a back or like a flow.",
          "customer_role": "Admin",
          "context": "Team size not specified, using Hiver for support and knowledge management.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no integration with ClickUp for accessing articles.",
          "customer_ask": "We were not able to read ClickUp articles.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The current knowledge base setup requires duplicating content across platforms.",
          "customer_ask": "I have to create a Gmail inbox of some sort that she monitors as opposed to doing this.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The knowledge base cannot be set up as both internal and external simultaneously.",
          "customer_ask": "It would be great if we could do both one of each.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for a self-service bot for their agents.",
          "customer_ask": "A self-service bot would be helpful for our agents.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "75_1184762400299844154",
      "call_id": "1184762400299844154",
      "title": "Conservice Accounting/ Hiver AI",
      "started": "2025-11-07T23:30:03+05:30",
      "signals": [
        {
          "problem_statement": "The AI tagging system requires 10 manually tagged emails to learn, which may slow down the implementation process.",
          "customer_ask": "A way to auto-apply custom fields based on email signatures.",
          "suggested_solution": "If AI could grab information from signatures to fill custom fields automatically.",
          "customer_role": "CSM",
          "context": "Team size not specified, dealing with high email volume.",
          "confidence": "high"
        },
        {
          "problem_statement": "The sentiment analysis feature inaccurately marks emails as negative when they are auto-responses like 'mailbox not found'.",
          "customer_ask": "Clarification on how sentiment is determined.",
          "suggested_solution": "Improvement in the sentiment analysis to avoid misclassifying auto-responses.",
          "customer_role": "CSM",
          "context": "Team size not specified, dealing with high email volume.",
          "confidence": "high"
        },
        {
          "problem_statement": "Team members are closing emails prematurely, which may lead to unresolved issues and affect AI learning.",
          "customer_ask": "A warning when trying to close unresolved emails.",
          "suggested_solution": "Implement a 'send and tend' option to prevent premature email closures.",
          "customer_role": "CSM",
          "context": "Team size not specified, dealing with high email volume.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The current reporting capabilities do not allow tracking changes in sentiment over time.",
          "customer_ask": "Ability to pull reports on sentiment changes for monthly reviews.",
          "suggested_solution": "Develop reporting features to track sentiment changes over time.",
          "customer_role": "CSM",
          "context": "Team size not specified, dealing with high email volume.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "76_560965286115951240",
      "call_id": "560965286115951240",
      "title": "Hiver & bryson with bkarrenagency.com",
      "started": "2025-11-08T00:13:25+05:30",
      "signals": [
        {
          "problem_statement": "The shared inbox setup does not allow the executive assistant to filter emails properly, leading to clutter in the inbox.",
          "customer_ask": "I want my executive assistant to see all the same emails that are coming into my Gmail inbox.",
          "suggested_solution": "Implement a method to auto-close or filter emails to avoid clutter.",
          "customer_role": "Admin",
          "context": "10 people on the team using three shared inboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current plan limits the number of users and mailboxes, which restricts team access to the product.",
          "customer_ask": "I don't want to upgrade because it doubles the cost.",
          "suggested_solution": "Provide a more affordable upgrade option or a way to manage within the current limits.",
          "customer_role": "Admin",
          "context": "10 people on the team using three shared inboxes.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no way to automate the handling of duplicate late payment notices from vendors.",
          "customer_ask": "Is there a way for these automations to catch duplicate late payment notices?",
          "suggested_solution": "Develop a feature that can identify and filter out duplicate emails based on subject lines.",
          "customer_role": "Admin",
          "context": "10 people on the team using three shared inboxes.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer lacks a straightforward way to export data into Google Sheets for tracking team performance.",
          "customer_ask": "I'd love to have somebody quickly set it up so that I can just dump that data into a Google sheet automatically.",
          "suggested_solution": "Create an automated export feature that integrates with Google Sheets.",
          "customer_role": "Admin",
          "context": "10 people on the team using three shared inboxes.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "77_8167914542088254924",
      "call_id": "8167914542088254924",
      "title": "Hiver Trial Kick Off",
      "started": "2025-11-08T00:32:05+05:30",
      "signals": [
        {
          "problem_statement": "The current shared inbox setup is becoming hard to manage due to the number of project volumes.",
          "customer_ask": "Are we able to filter tags within an inbox?",
          "customer_role": "CSM",
          "context": "Team size not specified, managing multiple projects and high email volume.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a need for automation to manage email assignments and organization more efficiently.",
          "customer_ask": "Can we set it so that emails are automatically directed to the right shared inbox based on project tags?",
          "customer_role": "CSM",
          "context": "Team size not specified, dealing with multiple projects and regulatory communications.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about losing track of emails that require follow-up.",
          "customer_ask": "Is there a way to nudge me if I haven't received a response to an email?",
          "customer_role": "Support Lead",
          "context": "Team size not specified, managing client communications.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a way to import historical emails into the new system.",
          "customer_ask": "How do you help customers with that onboarding transition?",
          "customer_role": "CSM",
          "context": "Team size not specified, transitioning to a new email management system.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "78_6608624762484707053",
      "call_id": "6608624762484707053",
      "title": "Good Vibe Squad <> Hiver pricing",
      "started": "2025-11-08T01:00:57+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unaware of significant pricing changes and feels forced into a higher payment tier without consent.",
          "customer_ask": "I would like to see what we can do to just downgrade this and request for a refund.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer feels that the product is not being utilized effectively for their needs, particularly in customer success.",
          "customer_ask": "I could downgrade to like the free plan and we wouldn't be affected.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is confused about being charged for more users than they actually have.",
          "customer_ask": "What is the bare minimum? And I don't know if you even have like a free plan that just doesn't have all the bells and whistles?",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is exploring options for using the product for sales outreach but is concerned about email deliverability issues.",
          "customer_ask": "Have you guys had any use cases of like, you know, huge outbound sales team using hiver?",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "79_6733089573398834509",
      "call_id": "6733089573398834509",
      "title": "Hiver Demo | Adam <> Cole",
      "started": "2025-11-08T01:30:25+05:30",
      "signals": [
        {
          "problem_statement": "The current email management process is inconsistent and varies among team members, leading to inefficiencies.",
          "customer_ask": "We need to standardize our email management processes.",
          "customer_role": "CSM",
          "context": "Team of 30-40, expanding to 60-70, using Outlook and distribution lists for email management.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is a lack of visibility into outstanding tasks and responsibilities within the team.",
          "customer_ask": "We need better visibility into what's outstanding and what needs to be completed.",
          "customer_role": "CSM",
          "context": "Team of 30-40, expanding to 60-70, using Outlook and distribution lists for email management.",
          "confidence": "high"
        },
        {
          "problem_statement": "The current system does not effectively handle the routing of emails based on the content, leading to potential delays in response.",
          "customer_ask": "We are looking for skill-based routing to improve email assignment.",
          "customer_role": "CSM",
          "context": "Team of 30-40, expanding to 60-70, using Outlook and distribution lists for email management.",
          "confidence": "high"
        },
        {
          "problem_statement": "There is no way to track whether team members are reading and responding to emails efficiently.",
          "customer_ask": "We need analytics to understand response times and email engagement.",
          "customer_role": "CSM",
          "context": "Team of 30-40, expanding to 60-70, using Outlook and distribution lists for email management.",
          "confidence": "high"
        },
        {
          "problem_statement": "The product currently lacks calendar integration, which is essential for scheduling meetings directly from emails.",
          "customer_ask": "Is there a calendar integration available?",
          "suggested_solution": "Implement calendar integration to sync with Outlook.",
          "customer_role": "CSM",
          "context": "Team of 30-40, expanding to 60-70, using Outlook and distribution lists for email management.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "80_5292951530895901561",
      "call_id": "5292951530895901561",
      "title": "Hiver Demo Studiopack<> Cole",
      "started": "2025-11-08T02:00:10+05:30",
      "signals": [
        {
          "problem_statement": "The customer is currently managing multiple inboxes and spreadsheets, leading to an inefficient and error-prone workflow.",
          "customer_ask": "The customer wants to automate their workflows and consolidate communication into a single inbox.",
          "suggested_solution": "The customer suggested using tokens in email subject lines to route replies correctly based on brand.",
          "customer_role": "CSM",
          "context": "The customer is a fractional consulting service for high volume photography studios, managing multiple brands.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks the knowledge to engineer the automation and token system needed for their communication setup.",
          "customer_ask": "The customer is looking for guidance on how to implement the token system and ensure proper email routing.",
          "suggested_solution": "The customer expressed a need for support in understanding how to set up the automation correctly.",
          "customer_role": "CSM",
          "context": "The customer is working with a client that has multiple brands and needs to separate responses based on brand.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "81_4159000703936356841",
      "call_id": "4159000703936356841",
      "title": "Hiver Introduction with Carrot",
      "started": "2025-11-08T03:00:34+05:30",
      "signals": [
        {
          "problem_statement": "Hiver currently does not integrate with Fivetran, which is a limitation for the customer's phone support needs.",
          "customer_ask": "Keep me posted on any developments regarding the Fivetran integration.",
          "suggested_solution": "Consider adding integration with Fivetran.",
          "customer_role": "VP of Operations",
          "context": "Oversees member success and customer success tools, evaluating CRM platforms.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "82_4237821098797114805",
      "call_id": "4237821098797114805",
      "title": "Hiver Onboarding",
      "started": "2025-11-10T09:31:16+05:30",
      "signals": [
        {
          "problem_statement": "The phone number field in the setup process has a character limit that does not accommodate longer toll-free numbers.",
          "customer_ask": "A way to input longer phone numbers without restrictions.",
          "customer_role": "Admin",
          "context": "Team size not specified, onboarding process.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is unsure about how to set up SLAs that consider only business hours.",
          "customer_ask": "Clarification on how to set SLAs based on business hours.",
          "customer_role": "Admin",
          "context": "Team size not specified, onboarding process.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is looking for a way to automate the tagging of emails based on specific criteria.",
          "customer_ask": "Automation for tagging emails based on content.",
          "customer_role": "Admin",
          "context": "Team size not specified, onboarding process.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer wants to ensure that their team can easily access and use templates for repetitive queries.",
          "customer_ask": "Help in creating and managing email templates.",
          "customer_role": "Admin",
          "context": "Team size not specified, onboarding process.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "83_6891956699798489920",
      "call_id": "6891956699798489920",
      "title": "Hiver Demo | michael <> Rakesh",
      "started": "2025-11-10T13:29:24+05:30",
      "signals": [
        {
          "problem_statement": "The customer spends a lot of time sorting through emails, which is inefficient for their small team.",
          "customer_ask": "They want a solution that can help them be more efficient without being as complex as Salesforce.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer has issues with tracking missing stock and damaged goods using a Google spreadsheet, which is time-consuming.",
          "customer_ask": "They want a system that can assign ticket numbers and track these issues more effectively.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer experienced a significant email loss due to a staff member deleting emails instead of responding.",
          "customer_ask": "They need a solution that ensures no emails are missed, even when staff are away.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer does not have any reporting or analytics on their email management, leading to a lack of visibility on email status.",
          "customer_ask": "They want to track how many emails are open, pending, or closed.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer needs a simple solution that non-technical staff can use without extensive training.",
          "customer_ask": "They require a user-friendly interface that their team can easily adopt.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer is concerned about managing personal emails of staff members while ensuring their own emails remain private.",
          "customer_ask": "They want to set up a hierarchy where they can manage staff members' personal inboxes without exposing their own.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer currently lacks integration with social media platforms like Facebook and Instagram for managing messages.",
          "customer_ask": "They want to connect with Instagram messages, which is important for their business.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "84_8467393708427380958",
      "call_id": "8467393708427380958",
      "title": "Hiver <> Ramafilter : Demo",
      "started": "2025-11-10T13:31:55+05:30",
      "signals": [
        {
          "problem_statement": "The customer is facing disorganization and clutter in their current email handling process, leading to missed communications.",
          "customer_ask": "A centralized platform to handle emails and chat support.",
          "suggested_solution": "A structured flow that acts as a bridge between the team and customers.",
          "customer_role": "CSM",
          "context": "A team of five handling customer support across multiple regions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks individual email addresses for team members, which complicates email management.",
          "customer_ask": "To introduce individual email addresses for team members.",
          "suggested_solution": "Using personal Gmail accounts for company-related inboxes is not ideal.",
          "customer_role": "CSM",
          "context": "A team of five handling customer support across multiple regions.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer is looking for AI capabilities to automate responses based on keywords to improve response times.",
          "customer_ask": "AI responses to customer inquiries based on keywords.",
          "suggested_solution": "AI agents to handle conversations before they reach human agents.",
          "customer_role": "CSM",
          "context": "A team of five handling customer support across multiple regions.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The customer needs to set up SLA policies to manage response times effectively.",
          "customer_ask": "To understand how to set SLA breaches.",
          "suggested_solution": "Setting up SLA policies for different emails based on response times.",
          "customer_role": "CSM",
          "context": "A team of five handling customer support across multiple regions.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer wants to download analytics reports to track SLA breaches and customer inquiries.",
          "customer_ask": "To know how to download analytics reports.",
          "suggested_solution": "Exporting reports to CSV based on different parameters.",
          "customer_role": "CSM",
          "context": "A team of five handling customer support across multiple regions.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "85_8404049517560791372",
      "call_id": "8404049517560791372",
      "title": "Virtue Tax <> Hiver || Renewal discussion",
      "started": "2025-11-10T14:27:48.224+05:30",
      "signals": [
        {
          "problem_statement": "The AI sentiment analysis feature does not work in Hebrew, limiting its usefulness for the customer.",
          "customer_ask": "To improve AI sentiment analysis to recognize Hebrew.",
          "suggested_solution": "Enhance the AI to better identify emotions in local languages.",
          "customer_role": "Admin",
          "context": "Team size of 17, using AI sentiment analysis.",
          "confidence": "high"
        },
        {
          "problem_statement": "The sentiment analysis does not accurately classify sentiments as positive or negative based on recognized keywords.",
          "customer_ask": "To improve the accuracy of sentiment classification.",
          "suggested_solution": "Tweak the AI to better identify sentiment patterns.",
          "customer_role": "Admin",
          "context": "Team size of 17, using AI sentiment analysis.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "86_2840736752872732243",
      "call_id": "2840736752872732243",
      "title": "Hiver Demo | Simon <> Rakesh",
      "started": "2025-11-10T15:01:13+05:30",
      "signals": [
        {
          "problem_statement": "The customer support team forgets to reply to angry emails from customers, leading to unresolved issues.",
          "customer_ask": "A tool that can flag emails where support did not reply or did not reply appropriately.",
          "suggested_solution": "Implement a flagging tool to manage email responses.",
          "customer_role": "CSM",
          "context": "30 people in customer support, managing over 2000 active construction sites.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks a sentiment analysis tool to identify angry customers and adjust responses accordingly.",
          "customer_ask": "A sentiment analyzer that can indicate when a customer is angry.",
          "suggested_solution": "A tool that analyzes customer emails to determine sentiment and suggest appropriate responses.",
          "customer_role": "CSM",
          "context": "30 people in customer support, managing over 2000 active construction sites.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a way to automatically categorize emails by construction site to improve quality management.",
          "customer_ask": "A dashboard that shows construction sites and associated emails.",
          "suggested_solution": "Automatically tag emails by construction site to facilitate easier tracking and management.",
          "customer_role": "CSM",
          "context": "30 people in customer support, managing over 2000 active construction sites.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "87_389262988359592902",
      "call_id": "389262988359592902",
      "title": "Hiver Feedback | Asha <> Yukta",
      "started": "2025-11-10T18:11:36+05:30",
      "signals": [
        {
          "problem_statement": "The current ticket management system is insufficient for the customer's needs.",
          "customer_ask": "Looking for something more advanced than Lina AI.",
          "customer_role": "Admin",
          "context": "Team size not specified, focusing on ticket management and email management.",
          "confidence": "high"
        },
        {
          "problem_statement": "The product does not support integration with WhatsApp for chatbot functionality.",
          "customer_ask": "Integration of a WhatsApp chatbot.",
          "suggested_solution": "Enable WhatsApp chatbot functionality.",
          "customer_role": "Admin",
          "context": "Team size not specified, focusing on WhatsApp usage for communication.",
          "confidence": "high"
        },
        {
          "problem_statement": "The product lacks support for Arabic conversation in the chatbot.",
          "customer_ask": "Support for Arabic conversation over WhatsApp.",
          "suggested_solution": "Implement Arabic language support in the chatbot.",
          "customer_role": "Admin",
          "context": "Team size not specified, focusing on communication needs in Arabic.",
          "confidence": "medium"
        },
        {
          "problem_statement": "The product does not currently support forms and customer portal features.",
          "customer_ask": "Inquiry about forms and customer portal support.",
          "suggested_solution": "Add support for forms and customer portal.",
          "customer_role": "Admin",
          "context": "Team size not specified, looking for enhanced customer interaction features.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "88_3360790303363631583",
      "call_id": "3360790303363631583",
      "title": "Hiver & Rana with Air IQ",
      "started": "2025-11-10T17:58:04+05:30",
      "signals": [
        {
          "problem_statement": "The customer needs automation to assign emails to different departments based on the content of the emails.",
          "customer_ask": "We might need some automations plus AI to automatically transfer emails to the appropriate group.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Operations team handling customer emails related to airline services."
        },
        {
          "problem_statement": "The customer lacks a feature to automatically notify team leads when SLA breaches occur.",
          "customer_ask": "Do we have an option to escalate that particular email directly to the team leader?",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Operations team managing multiple email groups."
        },
        {
          "problem_statement": "The customer requires a feature that allows agents to see pending emails immediately after closing a ticket.",
          "customer_ask": "I want the new ticket to open in my screen as soon as I resolve one.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Operations team handling customer emails."
        },
        {
          "problem_statement": "The customer is looking for AI capabilities to track SLA breaches and provide real-time reporting.",
          "customer_ask": "If you have any automations to track our SLA breaches and the current reports.",
          "confidence": "high",
          "customer_role": "Admin",
          "context": "Operations team managing customer emails."
        },
        {
          "problem_statement": "The customer needs a writing assistance feature to help agents with grammatical errors in emails.",
          "customer_ask": "If you have that feature already with you guys, that will be very helpful for us.",
          "confidence": "medium",
          "customer_role": "Admin",
          "context": "Operations team handling customer emails."
        }
      ]
    },
    {
      "transcript_id": "89_1503865447707759680",
      "call_id": "1503865447707759680",
      "title": "Hiver Demo | Chris <> Yukta",
      "started": "2025-11-10T18:30:53+05:30",
      "signals": [
        {
          "problem_statement": "The customer struggles to manage inbound client questions effectively due to distractions and lack of organization.",
          "customer_ask": "A ticketing system for tracking response times and assigning emails to team members.",
          "suggested_solution": "Implement a structured system for handling client email questions.",
          "customer_role": "Admin",
          "context": "Small business with about 150 clients, managing 5-10 client questions per week.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer lacks a way to categorize and prioritize client emails, leading to potential delays in responses.",
          "customer_ask": "A system for tagging and categorizing emails for better organization.",
          "suggested_solution": "Use tags to sort and categorize incoming emails.",
          "customer_role": "Admin",
          "context": "Small business with about 150 clients, managing 5-10 client questions per week.",
          "confidence": "high"
        },
        {
          "problem_statement": "The customer needs a way to track the performance of their email responses and team efficiency.",
          "customer_ask": "Access to analytics and reporting on email response times and team performance.",
          "suggested_solution": "Provide metrics and reports on email handling and response times.",
          "customer_role": "Admin",
          "context": "Small business with about 150 clients, managing 5-10 client questions per week.",
          "confidence": "medium"
        }
      ]
    },
    {
      "transcript_id": "90_416503973008057754",
      "call_id": "416503973008057754",
      "title": "Nora Maria<>Hiver: Introductory Call",
      "started": "2025-11-10T18:32:05+05:30",
      "signals": [
        {
          "problem_statement": "Missive has a complicated setup for managing delegated inboxes, making it difficult for users to see and manage emails assigned to colleagues.",
          "customer_ask": "A simpler way to manage delegated inboxes.",
          "customer_role": "Admin",
          "context": "Managing customer communications for a social media agency with multiple accounts.",
          "confidence": "high"
        },
        {
          "problem_statement": "The integration with Instagram in Missive is unstable, leading to disconnections that require manual checks to ensure messages are being received.",
          "customer_ask": "A more stable connection for Instagram integration.",
          "customer_role": "Admin",
          "context": "Managing 30 Instagram accounts with high volume of conversations.",
          "confidence": "high"
        },
        {
          "problem_statement": "Missive lacks social media integration, which is essential for managing communications across platforms like Instagram and TikTok.",
          "customer_ask": "Integration with social media platforms, especially Instagram and TikTok.",
          "customer_role": "Admin",
          "context": "Social media management for clients, requiring a central inbox for all communications.",
          "confidence": "high"
        }
      ]
    },
    {
      "transcript_id": "91_2148549465412012597",
      "call_id": "2148549465412012597",
      "title": "Exploring Hiver for Pratilipi",
      "started": "2025-11-10T18:35:18+05:30",
      "signals": [
        {
          "problem_statement": "The customer is unable to create additional shared mailboxes due to a limitation in the current plan.",
          "customer_ask": "We would require like three more shared mailboxes.",
          "suggested_solution": "Consider upgrading to a plan that allows for more shared mailboxes.",
          "customer_role": "Admin",
          "context": "Team size of approximately 30 people across multiple departments.",
          "confidence": "high"
        },
        {
          "problem_statement": "The default SLA settings for the PPS team are not functioning as expected, specifically the 'due soon' status is not visible.",
          "customer_ask": "The PPS team needs reminders for what has to go up, when and things of that sort.",
          "suggested_solution": "The PPS team should reach out to support for assistance.",
          "customer_role": "Admin",
          "context": "PPS team requires timely reminders for task management.",
          "confidence": "medium"
        }
      ]
    }
  ]
}