{
  "Email Management": [
    {
      "Email Visibility | Assigned Emails": [
        {
          "ask": "We need a tool that provides easy visibility of emails assigned to specific individuals.",
          "evidence": "His priority is that he wants like a visibility of those emails being assigned to him because right now we're just using this card. And honestly, we have like a 1,000 emails not being deleted in the inbox. And like the starred ones are just like hard to find.",
          "transcript_id": "01_113674299977064327",
          "transcript_title": "Hiver Demo | Rain <> Alex",
          "started": "2026-01-27T01:01:48+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Multiple Inboxes": [
        {
          "ask": "We need the ability to manage both personal and shared inboxes seamlessly without moving emails manually.",
          "evidence": "Hiver is supposed to help you do the info emails but not the personal emails, personal inbox management is your personal inbox.",
          "transcript_id": "100_6665942681643828406",
          "transcript_title": "Hiver Onboarding",
          "started": "2026-01-19T16:31:30+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a system that allows us to manage multiple Gmail workspaces with individual logins and centralized access.",
          "evidence": "Right now, we are opening up every Gmail workspaces, we're sharing passwords to get in. Would love to have a system where each individual has their own login, have all those workspaces in a like kind of like outlook where you can have multiple email addresses within like a centralized place.",
          "transcript_id": "56_9199714855509473782",
          "transcript_title": "Hiver Demo | Bianca <> Alex",
          "started": "2026-01-21T23:31:21+05:30",
          "priority": "Medium"
        },
        {
          "ask": "I want to be able to be logged into my own email, my main email and I want to be able to see and manage multiple inboxes from my main view.",
          "evidence": "The main need like the most urgent need that we need no matter what is, I want to be able to be logged into my own email, my main email and I want to be able to see and manage multiple inboxes.",
          "transcript_id": "61_2082795139548640353",
          "transcript_title": "Hiver Demo : Pawel <> Cole",
          "started": "2026-01-21T22:01:00+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Response Time Tracking": [
        {
          "ask": "We need to measure and establish our response time and ensure we are not out of this frame.",
          "evidence": "We were losing track of the conversations and some of them were just rolling out of the plate and we were let's say like some to some people, we were giving them less than 24 hours.",
          "transcript_id": "18_2647005837511241417",
          "transcript_title": "Hiver Demo | Andrey <> Matthew",
          "started": "2026-01-23T23:31:11+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Missed Emails": [
        {
          "ask": "We need a system to manage shared inboxes efficiently to prevent missed requests and deadlines.",
          "evidence": "The number of missed requests, missed deadlines missed. You know, hey, what's my status here's? My purchase order, please put this into production. That number is getting higher and we need something to reel that in and stop that from happening because you can't lose business like that, right?",
          "transcript_id": "21_2546157994919629231",
          "transcript_title": "Hiver Demo | Justin <> Rakesh",
          "started": "2026-01-23T20:31:40+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a solution to prevent missed emails, especially for deadlines and client deliverables.",
          "evidence": "Yeah, the biggest thing is just like missed emails because we're not always monitoring like the shared one.",
          "transcript_id": "55_8310478040888912873",
          "transcript_title": "Vently<>Hiver: Intro Call",
          "started": "2026-01-21T23:31:39+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Cross-team collaboration": [
        {
          "ask": "We need a way to collaborate and work together on emails without having to extract it and take it into spreadsheets and other documents.",
          "evidence": "So to boil it down, it's pretty much look sometimes as I mentioned, sometimes if all of the documentation and all of the information comes in correctly, then there's a chance that we don't have to interact with anybody, right? So the administration team and the finance team can do it all themselves. But a lot of the times I would say maybe the majority of times there needs to be, a cross team collaboration in order to like take something to completion.",
          "transcript_id": "23_7407101764994818831",
          "transcript_title": "Cargobot <> Hiver (scoping & workflow)",
          "started": "2026-01-23T19:32:04+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Unified Interface": [
        {
          "ask": "We need a system that allows us to manage different email addresses within a single interface to avoid jumping between multiple windows.",
          "evidence": "Currently, now we're doing it manually. So maybe you can just quickly show him how that is done automatically. So it's not something we need to manage the platform, manages that.",
          "transcript_id": "26_4129125879769270309",
          "transcript_title": "Hiver Feedback and Next Steps <> Reschedule",
          "started": "2026-01-23T13:30:59+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Access | Shared Inbox Password": [
        {
          "ask": "I need access to the shared inbox email to proceed with the setup.",
          "evidence": "No, that's from the, one of the managers, they have access to the admin console. Would I need that information? I think then someone else should be the ones running this demo, because I don't think they would give me access to that.",
          "transcript_id": "36_3083264483367128328",
          "transcript_title": "Hiver Product Demo: Kevin<> Matthew",
          "started": "2026-01-22T22:32:04+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Attachments | Attachment Errors": [
        {
          "ask": "We expect to be able to add attachments to emails without encountering errors.",
          "evidence": "Every time I try to add an attachment to send to anybody, it stays invalid and I can't send anything.",
          "transcript_id": "53_5339109119606905611",
          "transcript_title": "AFS | Hiver kick off",
          "started": "2026-01-22T00:30:59+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Status | Read/Unread Confusion": [
        {
          "ask": "I need a solution to manage inbound emails and oversee if emails were opened and processed.",
          "evidence": "That's why I need something to help me manage the inbound. And then also, so I can oversee, did we actually open the email? Was it processed stuff like that?",
          "transcript_id": "60_5407670113724320637",
          "transcript_title": "Hiver Demo | joe <> Alex",
          "started": "2026-01-21T22:05:04.102+05:30",
          "priority": "Medium"
        },
        {
          "ask": "Ensure that emails are not marked as read unless manually opened by the user.",
          "evidence": "Alaa reported to me that she didn't catch a couple of emails for the past couple of days because they were already marked as read.",
          "transcript_id": "70_5820310903453040987",
          "transcript_title": "Hiver & Gabriel with Discuss",
          "started": "2026-01-21T01:01:14+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Response Time": [
        {
          "ask": "We need a solution to improve email management, response time, and ensure emails are replied to.",
          "evidence": "They're having some issues with email management, response time and emails not being replied at all.",
          "transcript_id": "62_3036148842631328310",
          "transcript_title": "Exploring Hiver for ITS Logistics",
          "started": "2026-01-21T21:23:14+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Authentication | Google Group Authentication": [
        {
          "ask": "Ensure that all group emails are properly authenticated and accessible to designated members.",
          "evidence": "It looks like the accounts payable one's not authenticated. Is that one definitely? That's a group email. Yeah, it's a group and are you on that one as well? Are you a member or manager of that?",
          "transcript_id": "69_3216979097288633448",
          "transcript_title": "Hiver Trial Kick Off",
          "started": "2026-01-21T02:30:05+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Assignment | Automatic Assignment": [
        {
          "ask": "We need the ability to automatically assign emails based on keywords in the subject line.",
          "evidence": "I would like to be able to assign, you know, have some rules that assign automatically based on some keywords in the subject line.",
          "transcript_id": "83_6825426549092728742",
          "transcript_title": "Hiver Demo | john <> Alex",
          "started": "2026-01-20T20:31:20+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Search | Historical Emails": [
        {
          "ask": "I need to be able to search all my historical emails by reference number, customer name, or email.",
          "evidence": "I want to be able to search all my historical emails to be able to find anything that has that reference number, right? That's one example. Or I want to be able to search by a customer name.",
          "transcript_id": "84_2974916515073254246",
          "transcript_title": "Hiver Demo: David <> Cole",
          "started": "2026-01-20T20:29:34+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Centralized Inbox": [
        {
          "ask": "We need a centralized place for email management to ensure visibility and collaboration among team members.",
          "evidence": "We lose visibility. We don't know what exactly happening or where are we in terms of the onboarding process.",
          "transcript_id": "87_993716661141324191",
          "transcript_title": "Hiver Demo | Mendy <> Yukta",
          "started": "2026-01-20T18:01:43+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Management | Auto-closing Notifications": [
        {
          "ask": "We need a way to automatically close notification emails to reduce clutter and save time.",
          "evidence": "There's a couple emails that are just like sending us an email that someone placed an order? So that's just like wasting our time and space. So, is there a way to flag that? So it doesn't happen.",
          "transcript_id": "92_8426342443586700027",
          "transcript_title": "Hiver Demo | Lindsay <> Alex",
          "started": "2026-01-20T01:00:38+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Data and Security": [
    {
      "Data Storage | Regional Data Hosting": [
        {
          "ask": "We need the capability to store player data in specific regions to comply with GDPR and other regulations.",
          "evidence": "Tickets in Europe should be retained, the data in a data center in Europe versus North America, for example, and vice versa.",
          "transcript_id": "02_3711224057354889089",
          "transcript_title": "Hiver Demo | Roberta <> Cole",
          "started": "2026-01-27T00:59:57+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Security Approval | Microsoft SSO Blocker": [
        {
          "ask": "Ensure Hiver is approved on our Microsoft admin console to avoid any security blockers.",
          "evidence": "It's just that sometimes third party applications are blocked through their sso model, and that's what we use because we try to keep it as secure as possible.",
          "transcript_id": "17_6082051746028066610",
          "transcript_title": "Hiver Demo | Chronicle Heritage",
          "started": "2026-01-23T23:31:56+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Data Export | Legal Compliance": [
        {
          "ask": "We need the ability to export data for legal compliance and court submissions.",
          "evidence": "Because the data, we are the company facing a lot of legal, some legal issues with it. So if court is asking if the honorable court is asking the proof of the compensation. These are the things supposed to provide with the backend information and the front end information to submit a quote.",
          "transcript_id": "27_6356360796450114329",
          "transcript_title": "Hiver Demo | Rabin <> Yukta",
          "started": "2026-01-23T12:35:39+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Security | Data Privacy": [
        {
          "ask": "We need assurance that the solution is secure and does not use open AI tools that compromise data privacy.",
          "evidence": "For us, of course, it's important that it is secure and, you know, there's a lot of tools out there that are just like using open AI. So for us, it would be hard, we are a small company, but we were recently acquired by a big company that has a lot of, you know, due diligence and security concerns.",
          "transcript_id": "31_5198693765551927691",
          "transcript_title": "Hiver Demo | Paola <> Alex",
          "started": "2026-01-23T00:32:51+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "HIPAA Compliance | Cost for Small Business": [
        {
          "ask": "We need HIPAA compliance at a cost that fits our small business budget.",
          "evidence": "I've asked support regarding hipaa compliance and it is only available for the enterprise users, which is 100 dollars, and that basically, I mean, I'm going to be upfront with you that's really not going to be too… much of a budget for us.",
          "transcript_id": "33_6095409386840885709",
          "transcript_title": "Hiver Demo | Adlai <> Alex",
          "started": "2026-01-23T00:05:02+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "AI Capabilities": [
    {
      "AI Features | AI Copilot and Tagging": [
        {
          "ask": "We want to use AI for drafting replies and tagging before it reaches an agent.",
          "evidence": "I love this AI feature in Zendesk, it's not like this. I like that the agent has the ability to go back and forth in Zendesk. It just reads everything and it spits something out there's, no additional interaction. So, I love it like this. So we want to use the AI for this, but we also want to use the AI before it even reaches an agent before a ticket is created.",
          "transcript_id": "03_2617143474253486856",
          "transcript_title": "Hiver Meeting with StoreForce",
          "started": "2026-01-27T00:31:34+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Integration | Customizable AI": [
        {
          "ask": "We prefer to use Claude or Gemini for AI. Is that interchangeable or can it be integrated with other LLMs?",
          "evidence": "Well, the AI part, is… that customizable at all? Like let's say we, you know, prefer to use Claude or gemini. Is that interchangeable or can it be integrated with?",
          "transcript_id": "15_3729624758327324245",
          "transcript_title": "Hiver Demo | Kwontified Client <> Matthew",
          "started": "2026-01-24T01:02:17+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Tagging | Automated Tag Application": [
        {
          "ask": "I expect AI to automatically apply tags after initial manual tagging to streamline email organization.",
          "evidence": "So AI is going to automatically then start applying those tags for you, so we can set that up.",
          "transcript_id": "22_8006860585736791637",
          "transcript_title": "Hiver Product Demo: Shanice <> Yukta",
          "started": "2026-01-23T20:18:31+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Triage | Ticket Prioritization": [
        {
          "ask": "We need AI to automate the categorization and response to L1 and L2 queries based on order status and customer requests.",
          "evidence": "We want to deflect all of those. We want to make sure that these are categorized and we have templatized answers for those.",
          "transcript_id": "24_5093419614128261659",
          "transcript_title": "Hiver AI Tasks and Automation",
          "started": "2026-01-23T18:30:31+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We want to clarify tickets by priority or by similar issues, but we can't do it in Zoho.",
          "evidence": "The main reason we want to clarify tickets by priority or by similar issues, but we can't do it in Zoho because we didn't find any special… maybe stuff for this project.",
          "transcript_id": "95_1652459537425685876",
          "transcript_title": "Hiver Demo | Alejandra <> Jeevan",
          "started": "2026-01-19T20:31:00+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Integration | Create to Quote from Email": [
        {
          "ask": "We need the ability to create a quote directly from an email received.",
          "evidence": "We've seen three people ask for create to quote from email in the last three days, which is wild.",
          "transcript_id": "37_1289687791315754817",
          "transcript_title": "Weekly Sales Review",
          "started": "2026-01-22T22:01:03+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Utilization | Operational Efficiency": [
        {
          "ask": "We want to explore AI solutions to improve operational efficiency, especially in customer support.",
          "evidence": "I think we're probably lacking there a bit or at least something that I want to push. I think from what I saw on your website, for example, it's like might be, you know, right now, we only have like pre made bots right? For customer support chats and stuff like that. And we're not really utilizing AI there.",
          "transcript_id": "39_2929594980253037313",
          "transcript_title": "Hiver<>Bluevine Capital Inc: Intro",
          "started": "2026-01-22T21:31:43+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Integration | Knowledge Base Utilization": [
        {
          "ask": "We want AI to effectively utilize our existing knowledge base, starting with validated public information, and expand as we gain trust in its capabilities.",
          "evidence": "We will start with a very limited set which are just the public question facts and answers and questions that are on our public website because we know that's also fully validated. And we want already to see how powerful AI is our hybrid is in, does it already find the right answer in that?",
          "transcript_id": "44_1349719854817525104",
          "transcript_title": "Hiver <> YUSO - AI for email replies",
          "started": "2026-01-22T16:02:02+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Automation | Email Response": [
        {
          "ask": "We need an AI agent that can automatically respond to 70% of customer queries through API integration without human intervention.",
          "evidence": "That's what I was telling you from the beginning itself, that there's no point making an agent sitting and go searching AWB number on shiprocket and then sending those that same status to the customer when the customer can see itself by mentioning the AWB number or order number on that API, understood?",
          "transcript_id": "45_3989100815385167076",
          "transcript_title": "Hiver Demo | Mrinal  <> Rakesh",
          "started": "2026-01-22T15:33:19+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Accuracy | Inaccurate AI Replies": [
        {
          "ask": "We need AI that provides accurate replies to customer inquiries.",
          "evidence": "We've been trying to use some of helpscout's built in AI that they have not loving the replies that it's coming up with. They're just not very accurate.",
          "transcript_id": "68_4615209453433614564",
          "transcript_title": "Hiver Demo | Jillanne <> Matthew",
          "started": "2026-01-21T04:02:14+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Integration | Domain-specific Responses": [
        {
          "ask": "We need the AI to provide specific answers based on the email domain to ensure correct responses for different client programs.",
          "evidence": "We need to be able to identify that, you know, it came from this email domain. So this is their payment timing as an example.",
          "transcript_id": "78_6278181404971582583",
          "transcript_title": "Hiver Product Demo/Trial Setup: Ashley<> Matthew",
          "started": "2026-01-20T22:01:21+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "AI Integration | AI-driven scheduling": [
        {
          "ask": "I want to build an AI-driven scheduling system to manage caregiver schedules and communications.",
          "evidence": "I'm hoping to do is to build an AI driven scheduling system and communication system for my admin team to use to really go out to caregivers and say, all right, we need to know what your week looks like coming up and what your availability is.",
          "transcript_id": "93_6500128928993864063",
          "transcript_title": "Hiver Demo | David <> Jeevan",
          "started": "2026-01-19T22:31:09+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Automation and Workflow": [
    {
      "Automation Setup | Personal to Shared Mailbox": [
        {
          "ask": "We want the ability to automatically move emails from personal inboxes to shared mailboxes without manual intervention.",
          "evidence": "There was some interest in if an email lands in your personal mailbox without an automation, you want to push it to the hiver, shared mailbox. Is that still an ask from your side? Yeah, I?",
          "transcript_id": "04_7661386211809349443",
          "transcript_title": "ShopHarbour <> Hiver",
          "started": "2026-01-27T00:29:10+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Automation | AIQA Parameters": [
        {
          "ask": "We need to utilize AI with our email to improve quality control and visibility.",
          "evidence": "I think having it with our email… I think is an absolute must. And so far it's definitely brought attention to some of our quality control issues.",
          "transcript_id": "05_2752398069336499060",
          "transcript_title": "Colonial Electric | Hiver Bi-Weekly",
          "started": "2026-01-27T00:01:29+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need the ability to set up automation based on the parameters within the AIQA.",
          "evidence": "Automation is, which is not present right now, right? So you cannot set up an automation based on the parameters within the aiqa?",
          "transcript_id": "97_6847037050485608243",
          "transcript_title": "K-Flex | Hiver requirements review",
          "started": "2026-01-19T19:33:08+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Automation | Email Assignment": [
        {
          "ask": "We want a simpler way to assign emails without using the shared inbox feature.",
          "evidence": "I feel like it's very, this software is actually really complicated considering we only want to do something really small…",
          "transcript_id": "10_1487658447530611449",
          "transcript_title": "Hiver Demo | Future Frontiers <> Jeevan",
          "started": "2026-01-26T19:31:15+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a good way to automate, tag, and assign emails to the right person based on order notifications and therapist orders.",
          "evidence": "We need to find a good way to automate and tag it and assign it to the right person. I think that's our main little issue we have.",
          "transcript_id": "46_1087960100346813360",
          "transcript_title": "Tisso <> Hiver",
          "started": "2026-01-22T15:30:23+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a way to automate email assignment based on workload to improve efficiency.",
          "evidence": "Right now, like on that side, it's manual because we have the team. And then the team is like organized on different, like sections or like locations in the us like from the states.",
          "transcript_id": "58_6274305514231728455",
          "transcript_title": "Meet with Sonali | Hiver (Adam Harless)",
          "started": "2026-01-21T23:00:24.736+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Automation | Survey Follow-up": [
        {
          "ask": "We want to automate survey follow-up emails based on specific tags.",
          "evidence": "We would want to send an email out... if it said survey, then it would get tagged and then it would send out an automatic email.",
          "transcript_id": "25_6521057880254029238",
          "transcript_title": "Hiver Product Demo: Sam <> Yukta",
          "started": "2026-01-23T17:46:49+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Automation | Complex Account Management": [
        {
          "ask": "We need more automations and a way to manage stakeholders at a really complex account.",
          "evidence": "I think truly looking for some more automations and a way to manage stakeholders at a really complex account.",
          "transcript_id": "63_5096362794739728615",
          "transcript_title": "Hiver Demo | Vaishnavy <> Alex",
          "started": "2026-01-21T20:01:59+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Automation | Pricing and Procurement": [
        {
          "ask": "We need the ability to automate the core bulk of requests, especially for pricing and procurement, to handle large volumes without hiring additional staff.",
          "evidence": "It's the ability to automate for that core bulk, very similar, 80 percent of requests that come in regardless of the client, the ability to automate as much of that process as possible and the ability to have flex to have flex in our system.",
          "transcript_id": "73_1591000138360586179",
          "transcript_title": "Hiver Demo | David <> Alex",
          "started": "2026-01-21T00:00:55+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Automation | Email Replies": [
        {
          "ask": "We need a system to automate email replies and send reminders.",
          "evidence": "If we can have… a shared inbox, and then also a system to track the status of the project based on the email interaction as well as automate some email reply, and then maybe automate a lot of the email requests, or reminders send email reminders and requests, as well as track the status of the project, that would be great.",
          "transcript_id": "91_6641573314310257690",
          "transcript_title": "Hiver Demo | Josh <> Yukta",
          "started": "2026-01-20T14:38:17+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Integration and Compatibility": [
    {
      "Voice Integration | Primary Contact Method": [
        {
          "ask": "We need a robust voice solution integrated into the platform as voice is our primary method of contact.",
          "evidence": "The biggest thing, that keeps us in the voice world is because of that, we do have multi channel or Omni channel, right? We have, we have, you know, all four common channels, right? But voice is still our predominant channel for customers today.",
          "transcript_id": "06_5755790460528470967",
          "transcript_title": "Hiver<>SalesRabbit: Intro",
          "started": "2026-01-26T22:00:17+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Knowledge Base | Integration with existing articles": [
        {
          "ask": "We need the ability to integrate our existing 900 articles into your knowledge base system for a seamless transition.",
          "evidence": "I think for a trial, it might be a bit easier cause we have about, I think 900 articles… but yeah, that's another thing that maybe, yeah, we would move the knowledge base as well to you guys, if that would be, you know, more commercially interesting for us to do it under one system as opposed to multiple different ones?",
          "transcript_id": "09_2224093275013510738",
          "transcript_title": "Hiver Demo | Robert <> Cole",
          "started": "2026-01-26T20:03:55+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Support Integration | Intercom Contract": [
        {
          "ask": "We need to consider Hiver once our current Intercom contract is nearing expiration.",
          "evidence": "It sounds like you just signed a contract with intercom. So I don't think now would be the best time to, you know, continue this conversation.",
          "transcript_id": "20_2087821096926055262",
          "transcript_title": "Hiver Demo Greenspace Health<> Cole",
          "started": "2026-01-23T21:01:19+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Integration | Gmail Overlay": [
        {
          "ask": "We need a tool integrated into Gmail that helps with customer service and AI functionalities.",
          "evidence": "So you're looking for something that's integrated into Gmail, right? Overlays into Gmail that helps with like customer service, AI and things of that nature.",
          "transcript_id": "28_7576382539080142878",
          "transcript_title": "Hiver Demo Murguia<> Cole",
          "started": "2026-01-23T04:32:00+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Chat Integration | Customizability": [
        {
          "ask": "We need the chat solution to be fully customizable to our specific needs.",
          "evidence": "Is this customizable to kind of, what we would need? This is?",
          "transcript_id": "38_7751981210817989260",
          "transcript_title": "Hiver Demo: Manny <> Alex",
          "started": "2026-01-22T21:31:46+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "ClickUp Integration | Automated Task Creation": [
        {
          "ask": "We need the ability to automatically create ClickUp tasks from emails to improve workflow efficiency.",
          "evidence": "The problem is whether they use the ClickUp widget or go into ClickUp. It's still a manual process. And so we don't get great adoption of them actually doing that.",
          "transcript_id": "40_4561350572484966890",
          "transcript_title": "Hiver <> Hip - ClickUp w/ Hiver Permalinks for Access/Visibility for non Hiver users",
          "started": "2026-01-22T21:02:33.891+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Interface Compatibility | Outlook Integration": [
        {
          "ask": "We need the ability to work from Outlook with the same features as Hiver.",
          "evidence": "Is it possible to have the demo from outlook web? So instead of the platform, hey, josh, just because we'd like to simulate, we'd like to be as close as possible to what CK is doing right now?",
          "transcript_id": "42_8242061446390138998",
          "transcript_title": "Hiver Demo | Francesco <> Rakesh",
          "started": "2026-01-22T19:00:16+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Integration | WhatsApp Handling": [
        {
          "ask": "We need a shared interface for WhatsApp to manage messages more efficiently.",
          "evidence": "Right now, it's our team leader who's handling all the WhatsApp messages. But sometimes if he's too busy, he will just forward the message to one of us and then we have to answer for him. But it's a lot of back and forth like forwarding. So it would be easier if we could just have a shared interface for WhatsApp.",
          "transcript_id": "47_6408879359998889802",
          "transcript_title": "Hiver Demo | Amy <> Yukta",
          "started": "2026-01-22T13:29:47+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Email Integration | Lotus Notes Compatibility": [
        {
          "ask": "We need Hiver to integrate with Lotus Notes to consider adopting it.",
          "evidence": "It was an instant no with the email platform that we use. So I never got to see anything that's why when, you know, I received the ping about it like, okay, guess, maybe now they support it.",
          "transcript_id": "52_5130744100353479568",
          "transcript_title": "Hiver Introduction with Accuride Inernational",
          "started": "2026-01-22T01:32:04.171+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Slack Integration | Two-way Sync": [
        {
          "ask": "We need a two-way sync between Hiver and Slack to ensure seamless communication and visibility on email threads.",
          "evidence": "A better solution would be to have a two-way sync here. Otherwise, the team will have to switch to Slack, continue the conversation there, and then come back to Hiver and close the loop.",
          "transcript_id": "64_877959386429179562",
          "transcript_title": "Hiver <> Picnic Technologies - Slack Integration",
          "started": "2026-01-21T20:01:23+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Integration | Knowledge Base": [
        {
          "ask": "We need the ability to integrate with Google Docs for our knowledge base, allowing us to add entire folders and monitor them for relevant content.",
          "evidence": "Is it only notion? That got this feature or the other apps? Google docs, I guess, Google? Docs you said, then you have got the options to download. I mean, upload those documents right from here. So those could be the custom ones, yeah. Yeah, but this is only one at a time, right? I mean, we can add a whole let's say an entire folder and just say watch this folder and see if there's anything in there that's relevant.",
          "transcript_id": "67_8867070846807083488",
          "transcript_title": "Hiver Onboarding <> Omni Set up",
          "started": "2026-01-21T16:01:32+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Outlook Integration | Shared Inboxes": [
        {
          "ask": "We need a solution that supports Outlook for managing shared inboxes.",
          "evidence": "Our IT director looked at Hiver a year or two ago, and he said Hiver was an immediate no because they were Gmail centric. Is that still the case?",
          "transcript_id": "76_7641424439134682605",
          "transcript_title": "Hiver Demo | Daniel <> Cole",
          "started": "2026-01-20T22:31:18+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Browser Compatibility | Chromium Requirement": [
        {
          "ask": "Ensure Hiver works on all major browsers, not just Chromium-based ones.",
          "evidence": "Apparently I, I've been setting everything up through my safari, but it looks like I need to be starting to set everything up through Google Chrome, if that seems like it's easier.",
          "transcript_id": "79_263815501789502510",
          "transcript_title": "Hiver Demo | Rose <> Cole",
          "started": "2026-01-20T21:31:31+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Slack Integration | Notification Context": [
        {
          "ask": "I want the Slack integration to provide full context in notifications, not just alerts.",
          "evidence": "I'd rather just do the thing like just leverage what's there because I don't want to like create an alert that basically says, hey, there's a problem but not provide any context to the problem.",
          "transcript_id": "80_7773616476513160064",
          "transcript_title": "Hiver Trial Setup/Questions with John",
          "started": "2026-01-20T21:31:16+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Salesforce Integration | Notes Sync": [
        {
          "ask": "We expect notes to sync with Salesforce via your API.",
          "evidence": "Do your notes push into Salesforce with your API? They do not. Okay. Yeah. Just curious.",
          "transcript_id": "94_6508058863700207280",
          "transcript_title": "AFS | Hiver Kick Off",
          "started": "2026-01-19T21:30:43+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Other / Review": [
    {
      "Sign-in Process | Account and Inbox Confusion": [
        {
          "ask": "I expect a clearer sign-in process that distinguishes between account and inbox options upfront.",
          "evidence": "I had a little bit of a hard time getting signed in the other day. I signed it wrong. It's confusing when you sign in like which one is your account, and which one is the inbox.",
          "transcript_id": "07_3659167064649677375",
          "transcript_title": "Hiver Demo: Roger <> Alex",
          "started": "2026-01-26T21:32:05+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Free Trial | Access Issues": [
        {
          "ask": "I expect to have seamless access to the free trial without technical issues.",
          "evidence": "I'm having trouble getting access to the free trial of hiver. I've downloaded the Chrome extension, but I'm running into like an it issue, not an it issue, but like I'm not able to log in.",
          "transcript_id": "12_584171158031307896",
          "transcript_title": "Hiver Demo | Lina <> Matthew",
          "started": "2026-01-24T03:03:53+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Survey Flexibility | Modify Customer Ratings": [
        {
          "ask": "We need the ability for users to modify their survey ratings after submission, especially if they made a mistake.",
          "evidence": "Sometimes a user will give a wrong rating or they'll give a rating with the misunderstanding that they were rating us and not like somebody we had to escalate to.",
          "transcript_id": "13_7543442387659559123",
          "transcript_title": "Hiver Demo | Jason <> Alex",
          "started": "2026-01-24T02:02:21+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Form Intake | Transition to Hiver": [
        {
          "ask": "We need a form intake system similar to Zendesk for a smooth transition to Hiver.",
          "evidence": "That is a bit of a sticking point right now on the transition to hiver, it's probably priority number one this year for our product team.",
          "transcript_id": "16_5955850787349652746",
          "transcript_title": "Hiver Introduction with Human Signal",
          "started": "2026-01-24T00:01:37+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Tagging Integration | Recreate Tags in Hiver": [
        {
          "ask": "We need to recreate our existing Gmail tagging structure in Hiver for routing purposes.",
          "evidence": "So, you, your labels today in Gmail have to be redone as tags in Hiver in order for routing purposes.",
          "transcript_id": "29_138044469863808563",
          "transcript_title": "Hiver Demo | Patricia <> Alex",
          "started": "2026-01-23T02:32:44+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Label Management | Remove Blue Labels": [
        {
          "ask": "I want the ability to remove or hide blue labels from my inbox as they clutter my view and are not relevant to me.",
          "evidence": "Just for me, it clutters my inbox with information for me. It's not relevant where it comes from. I can see already where it's coming from by the name.",
          "transcript_id": "43_3785062996898600263",
          "transcript_title": "Loyo Group <> Hiver : Connect",
          "started": "2026-01-22T17:00:25+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Ticketing System | Email Response": [
        {
          "ask": "I need the ticketing system to automatically send email updates to users when the status changes.",
          "evidence": "I need to be able to, whatever status I put in the ticket, you get a reply that way. You know, you know, that I'm working on it, you know, that I'm claiming it, you know, that I, you're not being ignored.",
          "transcript_id": "49_1014683444196100969",
          "transcript_title": "Hiver Demo | Horacio <> Matthew",
          "started": "2026-01-22T05:00:29+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Search Functionality | Document Management": [
        {
          "ask": "We need the ability to search and find documents within emails without downloading them to our computers.",
          "evidence": "But what the theory is if something's in your email box, that you can tag it right where you can find it in the search. And so the idea is if you can search and find it, you don't need to download it to your computer.",
          "transcript_id": "54_5959549569604523714",
          "transcript_title": "Hiver Requirements Review",
          "started": "2026-01-22T00:00:47+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Domain Switch | Email Domain Transition": [
        {
          "ask": "We need a seamless process to switch email domains without losing functionality or requiring a new account setup.",
          "evidence": "There is a probability in like three or four months, they would like need to switch the domain. Most likely, how is that going to work?",
          "transcript_id": "57_6341609175330272984",
          "transcript_title": "Hiver Onboarding Kickoff Call with Pavithra Sundar",
          "started": "2026-01-21T23:16:24.99+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Tagging System | Adaptive Tagging": [
        {
          "ask": "We need the tagging system to adapt and change based on the conversation flow, not just the initial email.",
          "evidence": "The initial email is a customer asking for a quote. So, let's say I add the smart tagging, the AI tagging and it would say quote, but then the customer sends us the tender. So now it's not a quote. It's a load to enter. And in a week or two, the customer is asking for information on where the load is. So the tagging will change to etas or so will they change?",
          "transcript_id": "59_5826131780612749030",
          "transcript_title": "Hiver AI <> WhiteArrow",
          "started": "2026-01-21T22:15:35+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Custom Status | Quoted Status": [
        {
          "ask": "We need a custom status like 'Quoted' between open and pending to track quotes more effectively.",
          "evidence": "Ideally what you were looking for is like a custom status. So in between open and pending, you would want to have another status like that's Quoted.",
          "transcript_id": "66_8889353542854619073",
          "transcript_title": "Hiver <> Yardlink",
          "started": "2026-01-21T16:32:07+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Label Migration | Gmail to Hiver": [
        {
          "ask": "We need a way to migrate existing Gmail labels to Hiver to maintain our email organization.",
          "evidence": "Once they come over to Hiver, we've lost those labels. So we've lost the organization. So, is there a way to fix that?",
          "transcript_id": "85_7521158571682856558",
          "transcript_title": "Canlift <> Hiver (Troubleshooting SM)",
          "started": "2026-01-20T19:58:42.524+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Draft Sharing | Automatic Sharing": [
        {
          "ask": "We need the ability to automatically share drafts without manual intervention.",
          "evidence": "One of the features that we're looking for... is the sharing draft feature... we wanted to understand if that can be done automatically... because we would need that for the workflow that we're trying to implement.",
          "transcript_id": "88_7239960926781683344",
          "transcript_title": "Hiver Demo | Manuel <> Yukta",
          "started": "2026-01-20T16:31:25+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Screen Sharing | Browser Access": [
        {
          "ask": "Ensure that screen sharing permissions are granted in the browser to facilitate smooth setup and training sessions.",
          "evidence": "It wouldn't let me share for some reason, please grant browser access. What does that mean?",
          "transcript_id": "96_6604874090656009325",
          "transcript_title": "Hiver Trial Setup <> Dr Paw Paw",
          "started": "2026-01-19T20:01:12+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Communication and Collaboration": [
    {
      "Shared Inbox | HR Admin Efficiency": [
        {
          "ask": "We need a system to simplify and manage the HR admin inbox to reduce errors and duplications.",
          "evidence": "It's just not done in a practical enough way, that there's duplications all the time. They make mistakes all the time. There's errors like always.",
          "transcript_id": "08_1888777207104989365",
          "transcript_title": "Hiver Demo | Angie De <> Alex",
          "started": "2026-01-26T20:33:08+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Call Management | Phone call triage": [
        {
          "ask": "We need a better process flow to manage and triage incoming phone calls effectively.",
          "evidence": "I'm just noticing that we're really spending an inordinate amount of time on phones with kind of erroneous conversations and, or we need to make sure we're capturing the important information, the call ins.",
          "transcript_id": "34_842069866218594494",
          "transcript_title": "Hiver Demo | Gary <> Matthew",
          "started": "2026-01-22T23:31:34+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Communication | 24/7 Availability": [
        {
          "ask": "We need to improve communication with patients to ensure 24/7 availability via chat, text, email, or phone calls.",
          "evidence": "I would like to try to improve communication with patients is just making sure that we can communicate 24 hours a day, seven days a week via chat, text, email, or phone calls.",
          "transcript_id": "48_5661640177508987905",
          "transcript_title": "Hiver Demo | Peter <> Cole",
          "started": "2026-01-22T05:31:20+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Shared Inbox | Visibility and Analytics": [
        {
          "ask": "We need a shared mailbox to track client interactions and provide analytics for better visibility and understanding of client needs.",
          "evidence": "You would still want to create the shared mailbox for it to be the catch for the conversations for analytics and all that stuff.",
          "transcript_id": "75_8411831052347429451",
          "transcript_title": "Hiver Custom Object Mapping",
          "started": "2026-01-20T22:59:53+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Shared Inbox | Incorrect Setup": [
        {
          "ask": "We need a properly configured shared inbox to move forward with the evaluation.",
          "evidence": "I have installed hiver… however, probably we… couldn't… do it well because… you told me that we need a shared inbox, and our it guys have given us a supposedly… shared inbox, but I think it is not what we wanted and we couldn't move forward honestly.",
          "transcript_id": "86_7988737626292762351",
          "transcript_title": "Hiver Catch-up <> Next Steps",
          "started": "2026-01-20T18:17:52+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Shared Inbox | Centralized Communication": [
        {
          "ask": "We need a shared inbox solution to centralize client communication in Gmail so that any team member can view conversation history and current status of emails.",
          "evidence": "One of the most important thing which is non negotiable for the, what we wanted to know is the centralization of client communication.",
          "transcript_id": "90_891541995576885643",
          "transcript_title": "Hiver Demo | Lenjemy <> Yukta",
          "started": "2026-01-20T15:32:41+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "App and System Performance": [
    {
      "Performance | System Slowdown": [
        {
          "ask": "We expect the system to run smoothly without causing delays or freezing when drafting emails or using other applications.",
          "evidence": "The whole computer freezes. If you're in another application and you're trying to do something, then it just freezes.",
          "transcript_id": "11_4715358631207289932",
          "transcript_title": "Hiver Shopify Integration & AI <> Dr Paw Paw",
          "started": "2026-01-26T19:01:26+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "App Performance | Mobile App Speed": [
        {
          "ask": "I expect the mobile app to be as responsive as the Gmail app.",
          "evidence": "It's not like horribly slow. It's like much slower than regular Gmail. Like it's less responsive.",
          "transcript_id": "71_4624730707298264356",
          "transcript_title": "Hiver Demo | Art <> Matthew",
          "started": "2026-01-21T00:32:45+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Pricing and Cost": [
    {
      "Pricing Model | Flexible Pricing": [
        {
          "ask": "We need a pricing model that accommodates 11 users with minimal features at a lower cost.",
          "evidence": "I might be able to spend 2000 dollars a year, but… I don't see that sort of solution because of the amount of people that we have, you know, we don't need anything but like tagging shared inboxes and 11 or 12 seats that's it. And there's no package that exists that does that honestly.",
          "transcript_id": "14_1099646396612374266",
          "transcript_title": "Hiver Sync | Scott <> Cole",
          "started": "2026-01-24T02:00:34+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a more flexible pricing model that doesn't require purchasing additional user seats in large increments.",
          "evidence": "If you want to add the eleventh user, you're going to purchase the bucket for the next five, 11 to 15.",
          "transcript_id": "50_341650998644687767",
          "transcript_title": "BCX Insurance | Hiver - Workflow review",
          "started": "2026-01-22T03:00:49.48+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing Model | Tiered Pricing Requirement": [
        {
          "ask": "We need a more affordable pricing model for adding a small number of seats.",
          "evidence": "And to add more seats, basically, what it looks like is we have to go to… the next level? Nearly, you know, 100 percent, I'm sorry, 400 percent increase. And I just, that's too much for us.",
          "transcript_id": "19_5746768965274777324",
          "transcript_title": "Hiver & John with JOMO Pool Service",
          "started": "2026-01-23T21:57:37+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing | Flexible Plans": [
        {
          "ask": "We need more flexible pricing plans that can accommodate our seasonal business fluctuations.",
          "evidence": "Our business is highly seasonal, and the current pricing structure doesn't fit well with our needs.",
          "transcript_id": "30_6109508866409053974",
          "transcript_title": "Rentor.com | Hiver - Pricing + Workflow",
          "started": "2026-01-23T01:44:56.239+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need flexibility in user count as we currently have 14 users and do not require 15.",
          "evidence": "I think right now we only have 14 and you mentioned the new plan, we have to start at a 15 user base.",
          "transcript_id": "77_755110470745318505",
          "transcript_title": "Iterable | Hiver - Renewal",
          "started": "2026-01-20T22:31:01.024+05:30",
          "priority": "Medium"
        },
        {
          "ask": "We need a more affordable pricing option, possibly with a few free seats, as the current cost is high for our needs.",
          "evidence": "Paying 150 dollars a month is a lot for us for… and two or three people are going to need very limited access.",
          "transcript_id": "99_1672223396181821849",
          "transcript_title": "Hiver Demo | Daniel <> Yukta",
          "started": "2026-01-19T18:03:04+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing Model | Unexpected Cost Increases": [
        {
          "ask": "We need a clear and stable pricing model without unexpected increases.",
          "evidence": "I tried to go with four different MSP companies... they said, yeah, by the way we're exercising our contract rights, we're increasing the price and there was no flat minimum.",
          "transcript_id": "35_4393055857244937388",
          "transcript_title": "Hiver Demo | Ben <> Alex",
          "started": "2026-01-22T22:36:26+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing | AI Package Cost": [
        {
          "ask": "We need a clear understanding of the pricing structure for AI features and whether we can opt out of AI to maintain current pricing.",
          "evidence": "Being honest with you, I think hiver can add value as I said, but, in AI, but, I think we need to wait because we like, you know, things are going to evolve hiver, copilot, we need to evolve. So being 100 percent honest with you nowadays, doubling the price to have this feature for us. It's something not good.",
          "transcript_id": "41_7701648272911773069",
          "transcript_title": "PSR <> Hiver AI regroup",
          "started": "2026-01-22T20:01:15+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing | Cost of Service": [
        {
          "ask": "The service should be priced fairly and not exceed $7,000 a year for six users.",
          "evidence": "I'm not going to pay 100 dollars, a user, 100 dollars a user for six users. I am not doing that, you know, great. But it's not worth 600 dollars a month, almost 7,000 dollars a year.",
          "transcript_id": "51_5945073944421046167",
          "transcript_title": "Excellent Real Estate Group, Inc <> Hiver",
          "started": "2026-01-22T01:34:11+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing | Cost concerns": [
        {
          "ask": "We need a more affordable pricing option that fits within our budget.",
          "evidence": "Unfortunately, due to the cost being the main reason we won't be able to go ahead with you all as of now.",
          "transcript_id": "74_8754819031767746288",
          "transcript_title": "Hiver Sync",
          "started": "2026-01-20T23:31:02+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Pricing | Cost per user": [
        {
          "ask": "I don't want to pay for three people.",
          "evidence": "But then, are we going to pay for Brenda? Because I just want to pay for two people? I don't want to pay for three people.",
          "transcript_id": "98_4045156548696338978",
          "transcript_title": "Hiver Onboarding",
          "started": "2026-01-19T19:02:27+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Unmapped": [
    {
      "(no sub_theme)": [
        {
          "ask": "We need the chat feature to integrate with Hubspot to access applicant profiles and CRM data during conversations.",
          "evidence": "I think that would be like a make or break for us because we use Hubspot for everything for like our CRM and that is like a lot of the time they'll come in and they'll have questions about like their applicant status or something and we need their profile like readily available.",
          "transcript_id": "32_2475253460075444349",
          "transcript_title": "Ontario Tech University <> Hiver : Demo",
          "started": "2026-01-23T00:30:31+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Service Level and Support": [
    {
      "SLA Issues | Outbound Emails": [
        {
          "ask": "Ensure SLAs do not trigger for outbound emails sent from our logistics team.",
          "evidence": "It's saying the SLA is due to what's over June now, but Sarah's part of the logistics look.",
          "transcript_id": "65_2695425702527378227",
          "transcript_title": "Hiver Trial Feedback <> Dr Paw Paw",
          "started": "2026-01-21T20:00:30+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "SLA Tracking | Email Response Time": [
        {
          "ask": "We need the system to track every email response to ensure compliance with our 48-hour company-wide SLA.",
          "evidence": "I don't think it's capturing all of our SLA, as we like our company wide SLA, which is that every email that's received has a 48 hour full business day response time.",
          "transcript_id": "81_8391365494549470910",
          "transcript_title": "Noble Schools <> Hiver",
          "started": "2026-01-20T21:30:22+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Product Features and Differentiation": [
    {
      "Product Differentiation | Comparison with Zendesk": [
        {
          "ask": "Provide the main differentiators between Hiver and Zendesk in your email.",
          "evidence": "Yeah. And, in your email to me, if you could put like the main differentiators to Zendesk in it because knowing that's what we use and then I can send that onto him.",
          "transcript_id": "72_8663885298732490429",
          "transcript_title": "Hiver<>Securly Inc: Intro Call",
          "started": "2026-01-21T00:01:28+05:30",
          "priority": "Medium"
        }
      ]
    },
    {
      "Product Demo | Need for Tutorials": [
        {
          "ask": "We need to see a product demo or some tutorials about how to actually use the product correctly.",
          "evidence": "Let me know. We need to see a product demo or some tutorials about how to actually use the product correctly.",
          "transcript_id": "89_4682583914968491288",
          "transcript_title": "Mubi <> Hiver : Demo",
          "started": "2026-01-20T15:33:00+05:30",
          "priority": "Medium"
        }
      ]
    }
  ],
  "Account and User Management": [
    {
      "Admin Access | Permission Approval": [
        {
          "ask": "We need a streamlined process for admin approval to avoid delays in setup.",
          "evidence": "The only thing is, I don't think Tommy's on this call and he is the only one who has access or admin access right now.",
          "transcript_id": "82_8412740574963384283",
          "transcript_title": "Hiver | AFS trial kickoff",
          "started": "2026-01-20T21:03:03+05:30",
          "priority": "Medium"
        }
      ]
    }
  ]
}